
add_int_Ada_AMD64_g:     file format elf64-x86-64
add_int_Ada_AMD64_g
architecture: i386:x86-64, flags 0x00000150:
HAS_SYMS, DYNAMIC, D_PAGED
start address 0x0000000000002180

Program Header:
    PHDR off    0x0000000000000040 vaddr 0x0000000000000040 paddr 0x0000000000000040 align 2**3
         filesz 0x0000000000000268 memsz 0x0000000000000268 flags r--
  INTERP off    0x00000000000002a8 vaddr 0x00000000000002a8 paddr 0x00000000000002a8 align 2**0
         filesz 0x000000000000001c memsz 0x000000000000001c flags r--
    LOAD off    0x0000000000000000 vaddr 0x0000000000000000 paddr 0x0000000000000000 align 2**12
         filesz 0x0000000000001710 memsz 0x0000000000001710 flags r--
    LOAD off    0x0000000000002000 vaddr 0x0000000000002000 paddr 0x0000000000002000 align 2**12
         filesz 0x00000000000006bd memsz 0x00000000000006bd flags r-x
    LOAD off    0x0000000000003000 vaddr 0x0000000000003000 paddr 0x0000000000003000 align 2**12
         filesz 0x00000000000003f0 memsz 0x00000000000003f0 flags r--
    LOAD off    0x0000000000003db8 vaddr 0x0000000000004db8 paddr 0x0000000000004db8 align 2**12
         filesz 0x0000000000000313 memsz 0x0000000000002d08 flags rw-
 DYNAMIC off    0x0000000000003dc8 vaddr 0x0000000000004dc8 paddr 0x0000000000004dc8 align 2**3
         filesz 0x0000000000000210 memsz 0x0000000000000210 flags rw-
    NOTE off    0x00000000000002c4 vaddr 0x00000000000002c4 paddr 0x00000000000002c4 align 2**2

  DW_CFA_advance_loc: 8 to 0000000000002671
  DW_CFA_def_cfa_offset: 56
  DW_CFA_offset: r3 (rbx) at cfa-56
  DW_CFA_advance_loc: 7 to 0000000000002678
  DW_CFA_def_cfa_offset: 64
  DW_CFA_advance_loc: 42 to 00000000000026a2
  DW_CFA_def_cfa_offset: 56
  DW_CFA_advance_loc: 1 to 00000000000026a3
  DW_CFA_def_cfa_offset: 48
  DW_CFA_advance_loc: 1 to 00000000000026a4
  DW_CFA_def_cfa_offset: 40
  DW_CFA_advance_loc: 2 to 00000000000026a6
  DW_CFA_def_cfa_offset: 32
  DW_CFA_advance_loc: 2 to 00000000000026a8
  DW_CFA_def_cfa_offset: 24
  DW_CFA_advance_loc: 2 to 00000000000026aa
  DW_CFA_def_cfa_offset: 16
  DW_CFA_advance_loc: 2 to 00000000000026ac
  DW_CFA_def_cfa_offset: 8
  DW_CFA_nop

00000198 0000000000000010 0000016c FDE cie=00000030 pc=00000000000026b0..00000000000026b1
  DW_CFA_nop
  DW_CFA_nop
  DW_CFA_nop

000001ac ZERO terminator


Contents of the .debug_aranges section:

  Length:                   44
  Version:                  2
  Offset into .debug_info:  0x0
  Pointer Size:             8
  Segment Size:             0

    Address            Length
    0000000000002266 00000000000003c3 
    0000000000000000 0000000000000000 
  Length:                   44
  Version:                  2
  Offset into .debug_info:  0x14ee
  Pointer Size:             8
  Segment Size:             0

    Address            Length
    000000000000262a 000000000000001c 
    0000000000000000 0000000000000000 

Contents of the .debug_info section:

  Compilation Unit @ offset 0x0:
   Length:        0x14ea (32-bit)
   Version:       4
   Abbrev Offset: 0x0
   Pointer Size:  8
 <0><b>: Abbrev Number: 1 (DW_TAG_compile_unit)
    <c>   DW_AT_producer    : (indirect string, offset: 0x1b14): GNU Ada 8.2.0 -g -gnatA -gnatWb -gnatiw -g -gnatws -mtune=generic -march=x86-64
    <10>   DW_AT_language    : 13	(ADA 95)
    <11>   DW_AT_name        : (indirect string, offset: 0x9be): /home/haxor/Engineering/Programming/Disassembling-Binaries/Ada/Intel_Architecture/AMD64/Integer_Operations/Add_Int/With_Debug_Info/b~add_int.adb
    <15>   DW_AT_comp_dir    : (indirect string, offset: 0xeca): /home/haxor/Engineering/Programming/Disassembling-Binaries/Ada/Intel_Architecture/AMD64/Integer_Operations/Add_Int/With_Debug_Info
    <19>   DW_AT_low_pc      : 0x2266
    <21>   DW_AT_high_pc     : 0x3c3
    <29>   DW_AT_stmt_list   : 0x0
 <1><2d>: Abbrev Number: 2 (DW_TAG_array_type)
    <2e>   DW_AT_name        : (indirect string, offset: 0x7a5): ada_main__Tgnat_versionS
    <32>   DW_AT_type        : <0x4d>
    <36>   DW_AT_sibling     : <0x41>
 <2><3a>: Abbrev Number: 3 (DW_TAG_subrange_type)
    <3b>   DW_AT_type        : <0x46>
    <3f>   DW_AT_upper_bound : 20
 <2><40>: Abbrev Number: 0
 <1><41>: Abbrev Number: 4 (DW_TAG_const_type)
    <42>   DW_AT_type        : <0x2d>
    <46>   DW_AT_artificial  : 1
 <1><46>: Abbrev Number: 5 (DW_TAG_base_type)
    <47>   DW_AT_byte_size   : 4
    <48>   DW_AT_encoding    : 5	(signed)
    <49>   DW_AT_name        : (indirect string, offset: 0x1666): integer
 <1><4d>: Abbrev Number: 5 (DW_TAG_base_type)
    <4e>   DW_AT_byte_size   : 1
    <4f>   DW_AT_encoding    : 8	(unsigned char)
    <50>   DW_AT_name        : (indirect string, offset: 0xab1): character
 <1><54>: Abbrev Number: 6 (DW_TAG_volatile_type)
    <55>   DW_AT_type        : <0x4d>
 <1><59>: Abbrev Number: 2 (DW_TAG_array_type)
    <5a>   DW_AT_name        : (indirect string, offset: 0x1b8b): ada_main__Tada_main_program_nameS
    <5e>   DW_AT_type        : <0x4d>
    <62>   DW_AT_sibling     : <0x6d>
 <2><66>: Abbrev Number: 3 (DW_TAG_subrange_type)
    <67>   DW_AT_type        : <0x46>
    <6b>   DW_AT_upper_bound : 13
 <2><6c>: Abbrev Number: 0
 <1><6d>: Abbrev Number: 4 (DW_TAG_const_type)
    <6e>   DW_AT_type        : <0x59>
    <72>   DW_AT_artificial  : 1
 <1><72>: Abbrev Number: 5 (DW_TAG_base_type)
    <73>   DW_AT_byte_size   : 4
    <74>   DW_AT_encoding    : 7	(unsigned)
    <75>   DW_AT_name        : (indirect string, offset: 0xabb): ada_main__version_32
 <1><79>: Abbrev Number: 7 (DW_TAG_const_type)
    <7a>   DW_AT_type        : <0x72>
 <1><7e>: Abbrev Number: 8 (DW_TAG_subrange_type)
    <7f>   DW_AT_lower_bound : -2147483648
    <84>   DW_AT_upper_bound : 2147483647
    <89>   DW_AT_name        : (indirect string, offset: 0xb04): system__parameters__size_type
    <8d>   DW_AT_type        : <0x96>
 <1><91>: Abbrev Number: 6 (DW_TAG_volatile_type)
    <92>   DW_AT_type        : <0x7e>
 <1><96>: Abbrev Number: 9 (DW_TAG_base_type)
    <97>   DW_AT_byte_size   : 4
    <98>   DW_AT_encoding    : 5	(signed)
    <99>   DW_AT_name        : (indirect string, offset: 0x1759): system__parameters__Tsize_typeB
    <9d>   DW_AT_artificial  : 1
 <1><9d>: Abbrev Number: 8 (DW_TAG_subrange_type)
    <9e>   DW_AT_lower_bound : -2147483648
    <a3>   DW_AT_upper_bound : 2147483647
    <a8>   DW_AT_name        : (indirect string, offset: 0x47a): system__secondary_stack__ss_ptr
    <ac>   DW_AT_type        : <0x96>
 <1><b0>: Abbrev Number: 10 (DW_TAG_typedef)
    <b1>   DW_AT_name        : (indirect string, offset: 0x13a1): system__secondary_stack__chunk_ptr
    <b5>   DW_AT_decl_file   : 2
    <b6>   DW_AT_decl_line   : 162
    <b7>   DW_AT_decl_column : 9
    <b8>   DW_AT_type        : <0xbc>
 <1><bc>: Abbrev Number: 11 (DW_TAG_pointer_type)
    <bd>   DW_AT_byte_size   : 8
    <be>   DW_AT_type        : <0xc2>
 <1><c2>: Abbrev Number: 12 (DW_TAG_structure_type)
    <c3>   DW_AT_name        : (indirect string, offset: 0x192a): system__secondary_stack__chunk_id
    <c7>   DW_AT_alignment   : 16
    <c8>   DW_AT_decl_file   : 2
    <c9>   DW_AT_decl_line   : 164
    <ca>   DW_AT_decl_column : 9
    <cb>   DW_AT_GNAT_descriptive_type: <0x209>
    <cf>   DW_AT_sibling     : <0x18c>
 <2><d3>: Abbrev Number: 13 (DW_TAG_member)
    <d4>   DW_AT_name        : (indirect string, offset: 0x18e0): first
    <d8>   DW_AT_decl_file   : 2
    <d9>   DW_AT_decl_line   : 164
    <da>   DW_AT_decl_column : 19
    <db>   DW_AT_type        : <0x9d>
    <df>   DW_AT_data_member_location: 0
 <2><e0>: Abbrev Number: 13 (DW_TAG_member)
    <e1>   DW_AT_name        : (indirect string, offset: 0x1217): last
    <e5>   DW_AT_decl_file   : 2
    <e6>   DW_AT_decl_line   : 164
    <e7>   DW_AT_decl_column : 26
    <e8>   DW_AT_type        : <0x9d>
    <ec>   DW_AT_data_member_location: 4
 <2><ed>: Abbrev Number: 13 (DW_TAG_member)
    <ee>   DW_AT_name        : (indirect string, offset: 0x49a): prev
    <f2>   DW_AT_decl_file   : 2
    <f3>   DW_AT_decl_line   : 165
    <f4>   DW_AT_decl_column : 7
    <f5>   DW_AT_type        : <0xb0>
    <f9>   DW_AT_data_member_location: 8
 <2><fa>: Abbrev Number: 13 (DW_TAG_member)
    <fb>   DW_AT_name        : (indirect string, offset: 0x260): next
    <ff>   DW_AT_decl_file   : 2
    <100>   DW_AT_decl_line   : 165
    <101>   DW_AT_decl_column : 13
    <102>   DW_AT_type        : <0xb0>
    <106>   DW_AT_data_member_location: 16
 <2><107>: Abbrev Number: 14 (DW_TAG_structure_type)
    <108>   DW_AT_name        : (indirect string, offset: 0x94): system__secondary_stack__chunk_id__T4s___PAD
    <10c>   DW_AT_alignment   : 16
    <10d>   DW_AT_decl_file   : 2
    <10e>   DW_AT_decl_line   : 166
    <10f>   DW_AT_decl_column : 7
    <110>   DW_AT_GNAT_descriptive_type: <0x163>
    <114>   DW_AT_artificial  : 1
    <114>   DW_AT_sibling     : <0x124>
 <3><118>: Abbrev Number: 15 (DW_TAG_member)
    <119>   DW_AT_name        : F
    <11b>   DW_AT_decl_file   : 2
    <11c>   DW_AT_decl_line   : 166
    <11d>   DW_AT_decl_column : 37
    <11e>   DW_AT_type        : <0x124>
    <122>   DW_AT_data_member_location: 0
 <3><123>: Abbrev Number: 0
 <2><124>: Abbrev Number: 16 (DW_TAG_array_type)
    <125>   DW_AT_name        : (indirect string, offset: 0xfbb): system__secondary_stack__chunk_id__T4s
    <129>   DW_AT_GNAT_descriptive_type: <0x13b>
    <12d>   DW_AT_type        : <0x1f0>
    <131>   DW_AT_sibling     : <0x13b>
 <3><135>: Abbrev Number: 17 (DW_TAG_subrange_type)
    <136>   DW_AT_type        : <0x96>
 <3><13a>: Abbrev Number: 0
 <2><13b>: Abbrev Number: 18 (DW_TAG_structure_type)
    <13c>   DW_AT_name        : (indirect string, offset: 0x12a7): system__secondary_stack__chunk_id__T4s___XA
    <140>   DW_AT_byte_size   : 4
    <141>   DW_AT_decl_file   : 2
    <142>   DW_AT_decl_line   : 166
    <143>   DW_AT_decl_column : 37
    <144>   DW_AT_GNAT_descriptive_type: <0x18c>
    <148>   DW_AT_artificial  : 1
    <148>   DW_AT_sibling     : <0x163>
 <3><14c>: Abbrev Number: 13 (DW_TAG_member)
    <14d>   DW_AT_name        : (indirect string, offset: 0x11e2): system__secondary_stack__chunk_id__T3s___XDLU_first__last
    <151>   DW_AT_decl_file   : 2
    <152>   DW_AT_decl_line   : 166
    <153>   DW_AT_decl_column : 37
    <154>   DW_AT_type        : <0x159>
    <158>   DW_AT_data_member_location: 0
 <3><159>: Abbrev Number: 19 (DW_TAG_subrange_type)
    <15a>   DW_AT_name        : (indirect string, offset: 0x11e2): system__secondary_stack__chunk_id__T3s___XDLU_first__last
    <15e>   DW_AT_type        : <0x96>
    <162>   DW_AT_artificial  : 1
 <3><162>: Abbrev Number: 0
 <2><163>: Abbrev Number: 20 (DW_TAG_structure_type)
    <164>   DW_AT_name        : (indirect string, offset: 0x180e): system__secondary_stack__chunk_id__T4s___PAD___XVS
    <168>   DW_AT_decl_file   : 2
    <169>   DW_AT_decl_line   : 166
    <16a>   DW_AT_decl_column : 37
    <16b>   DW_AT_artificial  : 1
    <16b>   DW_AT_sibling     : <0x17d>
 <3><16f>: Abbrev Number: 13 (DW_TAG_member)
    <170>   DW_AT_name        : (indirect string, offset: 0xfbb): system__secondary_stack__chunk_id__T4s
    <174>   DW_AT_decl_file   : 2
    <175>   DW_AT_decl_line   : 166
    <176>   DW_AT_decl_column : 37
    <177>   DW_AT_type        : <0x203>
    <17b>   DW_AT_data_member_location: 0
 <3><17c>: Abbrev Number: 0
 <2><17d>: Abbrev Number: 21 (DW_TAG_member)
    <17e>   DW_AT_name        : mem
    <182>   DW_AT_decl_file   : 2
    <183>   DW_AT_decl_line   : 166
    <184>   DW_AT_decl_column : 7
    <185>   DW_AT_type        : <0x107>
    <189>   DW_AT_alignment   : 16
    <18a>   DW_AT_data_member_location: 32
 <2><18b>: Abbrev Number: 0
 <1><18c>: Abbrev Number: 22 (DW_TAG_structure_type)
    <18d>   DW_AT_name        : (indirect string, offset: 0x1be0): system__secondary_stack__memory___XUP
    <191>   DW_AT_byte_size   : 16
    <192>   DW_AT_decl_file   : 2
    <193>   DW_AT_decl_line   : 150
    <194>   DW_AT_decl_column : 9
    <195>   DW_AT_sibling     : <0x1dc>
 <2><199>: Abbrev Number: 13 (DW_TAG_member)
    <19a>   DW_AT_name        : (indirect string, offset: 0x39d): P_ARRAY
    <19e>   DW_AT_decl_file   : 3
    <19f>   DW_AT_decl_line   : 64
    <1a0>   DW_AT_decl_column : 9
    <1a1>   DW_AT_type        : <0x1f7>
    <1a5>   DW_AT_data_member_location: 0
 <2><1a6>: Abbrev Number: 23 (DW_TAG_structure_type)
    <1a7>   DW_AT_name        : (indirect string, offset: 0x1aee): system__secondary_stack__memory___XUB
    <1ab>   DW_AT_byte_size   : 8
    <1ac>   DW_AT_decl_file   : 3
    <1ad>   DW_AT_decl_line   : 64
    <1ae>   DW_AT_decl_column : 9
    <1af>   DW_AT_artificial  : 1
    <1af>   DW_AT_sibling     : <0x1ce>
 <3><1b3>: Abbrev Number: 15 (DW_TAG_member)
    <1b4>   DW_AT_name        : LB0
    <1b8>   DW_AT_decl_file   : 2
    <1b9>   DW_AT_decl_line   : 150
    <1ba>   DW_AT_decl_column : 9
    <1bb>   DW_AT_type        : <0x96>
    <1bf>   DW_AT_data_member_location: 0
 <3><1c0>: Abbrev Number: 15 (DW_TAG_member)
    <1c1>   DW_AT_name        : UB0
    <1c5>   DW_AT_decl_file   : 2
    <1c6>   DW_AT_decl_line   : 150
    <1c7>   DW_AT_decl_column : 9
    <1c8>   DW_AT_type        : <0x96>
    <1cc>   DW_AT_data_member_location: 4
 <3><1cd>: Abbrev Number: 0
 <2><1ce>: Abbrev Number: 13 (DW_TAG_member)
    <1cf>   DW_AT_name        : (indirect string, offset: 0xc65): P_BOUNDS
    <1d3>   DW_AT_decl_file   : 3
    <1d4>   DW_AT_decl_line   : 64
    <1d5>   DW_AT_decl_column : 9
    <1d6>   DW_AT_type        : <0x1fd>
    <1da>   DW_AT_data_member_location: 8
 <2><1db>: Abbrev Number: 0
 <1><1dc>: Abbrev Number: 24 (DW_TAG_array_type)
    <1dd>   DW_AT_name        : (indirect string, offset: 0x1ac8): system__secondary_stack__memory___XUA
    <1e1>   DW_AT_type        : <0x1f0>
    <1e5>   DW_AT_alignment   : 16
    <1e6>   DW_AT_sibling     : <0x1f0>
 <2><1ea>: Abbrev Number: 17 (DW_TAG_subrange_type)
    <1eb>   DW_AT_type        : <0x96>
 <2><1ef>: Abbrev Number: 0
 <1><1f0>: Abbrev Number: 5 (DW_TAG_base_type)
    <1f1>   DW_AT_byte_size   : 1
    <1f2>   DW_AT_encoding    : 7	(unsigned)
    <1f3>   DW_AT_name        : (indirect string, offset: 0x72b): system__storage_elements__storage_element
 <1><1f7>: Abbrev Number: 11 (DW_TAG_pointer_type)
    <1f8>   DW_AT_byte_size   : 8
    <1f9>   DW_AT_type        : <0x1dc>
 <1><1fd>: Abbrev Number: 11 (DW_TAG_pointer_type)
    <1fe>   DW_AT_byte_size   : 8
    <1ff>   DW_AT_type        : <0x1a6>
 <1><203>: Abbrev Number: 25 (DW_TAG_reference_type)
    <204>   DW_AT_byte_size   : 8
    <205>   DW_AT_type        : <0x124>
 <1><209>: Abbrev Number: 23 (DW_TAG_structure_type)
    <20a>   DW_AT_name        : (indirect string, offset: 0x1a88): system__secondary_stack__chunk_id___XVE
    <20e>   DW_AT_byte_size   : 16
    <20f>   DW_AT_decl_file   : 2
    <210>   DW_AT_decl_line   : 166
    <211>   DW_AT_decl_column : 37
    <212>   DW_AT_artificial  : 1
    <212>   DW_AT_sibling     : <0x258>
 <2><216>: Abbrev Number: 13 (DW_TAG_member)
    <217>   DW_AT_name        : (indirect string, offset: 0x18e0): first
    <21b>   DW_AT_decl_file   : 2
    <21c>   DW_AT_decl_line   : 166
    <21d>   DW_AT_decl_column : 37
    <21e>   DW_AT_type        : <0x9d>
    <222>   DW_AT_data_member_location: 0
 <2><223>: Abbrev Number: 13 (DW_TAG_member)
    <224>   DW_AT_name        : (indirect string, offset: 0x1217): last
    <228>   DW_AT_decl_file   : 2
    <229>   DW_AT_decl_line   : 166
    <22a>   DW_AT_decl_column : 37
    <22b>   DW_AT_type        : <0x9d>
    <22f>   DW_AT_data_member_location: 0
 <2><230>: Abbrev Number: 13 (DW_TAG_member)
    <231>   DW_AT_name        : (indirect string, offset: 0x49a): prev
    <235>   DW_AT_decl_file   : 2
    <236>   DW_AT_decl_line   : 166
    <237>   DW_AT_decl_column : 37
    <238>   DW_AT_type        : <0xb0>
    <23c>   DW_AT_data_member_location: 0
 <2><23d>: Abbrev Number: 13 (DW_TAG_member)
    <23e>   DW_AT_name        : (indirect string, offset: 0x260): next
    <242>   DW_AT_decl_file   : 2
    <243>   DW_AT_decl_line   : 166
    <244>   DW_AT_decl_column : 37
    <245>   DW_AT_type        : <0xb0>
    <249>   DW_AT_data_member_location: 0
 <2><24a>: Abbrev Number: 13 (DW_TAG_member)
    <24b>   DW_AT_name        : (indirect string, offset: 0x1106): mem___XVL16
    <24f>   DW_AT_decl_file   : 2
    <250>   DW_AT_decl_line   : 166
    <251>   DW_AT_decl_column : 37
    <252>   DW_AT_type        : <0x258>
    <256>   DW_AT_data_member_location: 0
 <2><257>: Abbrev Number: 0
 <1><258>: Abbrev Number: 11 (DW_TAG_pointer_type)
    <259>   DW_AT_byte_size   : 8
    <25a>   DW_AT_type        : <0x107>
 <1><25e>: Abbrev Number: 26 (DW_TAG_structure_type)
    <25f>   DW_AT_name        : (indirect string, offset: 0xcc6): system__secondary_stack__ss_stack__T5s
    <263>   DW_AT_decl_file   : 2
    <264>   DW_AT_decl_line   : 188
    <265>   DW_AT_decl_column : 7
    <266>   DW_AT_GNAT_descriptive_type: <0x32d>
    <26a>   DW_AT_artificial  : 1
    <26a>   DW_AT_sibling     : <0x327>
 <2><26e>: Abbrev Number: 13 (DW_TAG_member)
    <26f>   DW_AT_name        : (indirect string, offset: 0x18e0): first
    <273>   DW_AT_decl_file   : 2
    <274>   DW_AT_decl_line   : 188
    <275>   DW_AT_decl_column : 45
    <276>   DW_AT_type        : <0x9d>
    <27a>   DW_AT_data_member_location: 0
 <2><27b>: Abbrev Number: 13 (DW_TAG_member)
    <27c>   DW_AT_name        : (indirect string, offset: 0x1217): last
    <280>   DW_AT_decl_file   : 2
    <281>   DW_AT_decl_line   : 188
    <282>   DW_AT_decl_column : 45
    <283>   DW_AT_type        : <0x9d>
    <287>   DW_AT_data_member_location: 4
 <2><288>: Abbrev Number: 13 (DW_TAG_member)
    <289>   DW_AT_name        : (indirect string, offset: 0x49a): prev
    <28d>   DW_AT_decl_file   : 2
    <28e>   DW_AT_decl_line   : 188
    <28f>   DW_AT_decl_column : 45
    <290>   DW_AT_type        : <0xb0>
    <294>   DW_AT_data_member_location: 8
 <2><295>: Abbrev Number: 13 (DW_TAG_member)
    <296>   DW_AT_name        : (indirect string, offset: 0x260): next
    <29a>   DW_AT_decl_file   : 2
    <29b>   DW_AT_decl_line   : 188
    <29c>   DW_AT_decl_column : 45
    <29d>   DW_AT_type        : <0xb0>
    <2a1>   DW_AT_data_member_location: 16
 <2><2a2>: Abbrev Number: 14 (DW_TAG_structure_type)
    <2a3>   DW_AT_name        : (indirect string, offset: 0x437): system__secondary_stack__ss_stack__T5s__T6s___PAD
    <2a7>   DW_AT_alignment   : 16
    <2a8>   DW_AT_decl_file   : 2
    <2a9>   DW_AT_decl_line   : 188
    <2aa>   DW_AT_decl_column : 7
    <2ab>   DW_AT_GNAT_descriptive_type: <0x2fe>
    <2af>   DW_AT_artificial  : 1
    <2af>   DW_AT_sibling     : <0x2bf>
 <3><2b3>: Abbrev Number: 15 (DW_TAG_member)
    <2b4>   DW_AT_name        : F
    <2b6>   DW_AT_decl_file   : 2
    <2b7>   DW_AT_decl_line   : 188
    <2b8>   DW_AT_decl_column : 45
    <2b9>   DW_AT_type        : <0x2bf>
    <2bd>   DW_AT_data_member_location: 0
 <3><2be>: Abbrev Number: 0
 <2><2bf>: Abbrev Number: 16 (DW_TAG_array_type)
    <2c0>   DW_AT_name        : (indirect string, offset: 0x3a5): system__secondary_stack__ss_stack__T5s__T6s
    <2c4>   DW_AT_GNAT_descriptive_type: <0x2d6>
    <2c8>   DW_AT_type        : <0x1f0>
    <2cc>   DW_AT_sibling     : <0x2d6>
 <3><2d0>: Abbrev Number: 17 (DW_TAG_subrange_type)
    <2d1>   DW_AT_type        : <0x96>
 <3><2d5>: Abbrev Number: 0
 <2><2d6>: Abbrev Number: 18 (DW_TAG_structure_type)
    <2d7>   DW_AT_name        : (indirect string, offset: 0x16e6): system__secondary_stack__ss_stack__T5s__T6s___XA
    <2db>   DW_AT_byte_size   : 4
    <2dc>   DW_AT_decl_file   : 2
    <2dd>   DW_AT_decl_line   : 188
    <2de>   DW_AT_decl_column : 45
    <2df>   DW_AT_GNAT_descriptive_type: <0x18c>
    <2e3>   DW_AT_artificial  : 1
    <2e3>   DW_AT_sibling     : <0x2fe>
 <3><2e7>: Abbrev Number: 13 (DW_TAG_member)
    <2e8>   DW_AT_name        : (indirect string, offset: 0x1a03): system__secondary_stack__ss_stack__T5s__TT6sP1___XDLU_1__size
    <2ec>   DW_AT_decl_file   : 2
    <2ed>   DW_AT_decl_line   : 188
    <2ee>   DW_AT_decl_column : 45
    <2ef>   DW_AT_type        : <0x2f4>
    <2f3>   DW_AT_data_member_location: 0
 <3><2f4>: Abbrev Number: 19 (DW_TAG_subrange_type)
    <2f5>   DW_AT_name        : (indirect string, offset: 0x1a03): system__secondary_stack__ss_stack__T5s__TT6sP1___XDLU_1__size
    <2f9>   DW_AT_type        : <0x96>
    <2fd>   DW_AT_artificial  : 1
 <3><2fd>: Abbrev Number: 0
 <2><2fe>: Abbrev Number: 20 (DW_TAG_structure_type)
    <2ff>   DW_AT_name        : (indirect string, offset: 0x121c): system__secondary_stack__ss_stack__T5s__T6s___PAD___XVS
    <303>   DW_AT_decl_file   : 2
    <304>   DW_AT_decl_line   : 188
    <305>   DW_AT_decl_column : 45
    <306>   DW_AT_artificial  : 1
    <306>   DW_AT_sibling     : <0x318>
 <3><30a>: Abbrev Number: 13 (DW_TAG_member)
    <30b>   DW_AT_name        : (indirect string, offset: 0x3a5): system__secondary_stack__ss_stack__T5s__T6s
    <30f>   DW_AT_decl_file   : 2
    <310>   DW_AT_decl_line   : 188
    <311>   DW_AT_decl_column : 45
    <312>   DW_AT_type        : <0x327>
    <316>   DW_AT_data_member_location: 0
 <3><317>: Abbrev Number: 0
 <2><318>: Abbrev Number: 21 (DW_TAG_member)
    <319>   DW_AT_name        : mem
    <31d>   DW_AT_decl_file   : 2
    <31e>   DW_AT_decl_line   : 188
    <31f>   DW_AT_decl_column : 45
    <320>   DW_AT_type        : <0x2a2>
    <324>   DW_AT_alignment   : 16
    <325>   DW_AT_data_member_location: 32
 <2><326>: Abbrev Number: 0
 <1><327>: Abbrev Number: 25 (DW_TAG_reference_type)
    <328>   DW_AT_byte_size   : 8
    <329>   DW_AT_type        : <0x2bf>
 <1><32d>: Abbrev Number: 23 (DW_TAG_structure_type)
    <32e>   DW_AT_name        : (indirect string, offset: 0x4d6): system__secondary_stack__ss_stack__T5s___XVS
    <332>   DW_AT_byte_size   : 8
    <333>   DW_AT_decl_file   : 2
    <334>   DW_AT_decl_line   : 188
    <335>   DW_AT_decl_column : 45
    <336>   DW_AT_artificial  : 1
    <336>   DW_AT_sibling     : <0x348>
 <2><33a>: Abbrev Number: 13 (DW_TAG_member)
    <33b>   DW_AT_name        : (indirect string, offset: 0x192a): system__secondary_stack__chunk_id
    <33f>   DW_AT_decl_file   : 2
    <340>   DW_AT_decl_line   : 188
    <341>   DW_AT_decl_column : 45
    <342>   DW_AT_type        : <0x348>
    <346>   DW_AT_data_member_location: 0
 <2><347>: Abbrev Number: 0
 <1><348>: Abbrev Number: 25 (DW_TAG_reference_type)
    <349>   DW_AT_byte_size   : 8
    <34a>   DW_AT_type        : <0xc2>
 <1><34e>: Abbrev Number: 23 (DW_TAG_structure_type)
    <34f>   DW_AT_name        : (indirect string, offset: 0x195d): system__secondary_stack__ss_stack___XVE
    <353>   DW_AT_byte_size   : 16
    <354>   DW_AT_decl_file   : 2
    <355>   DW_AT_decl_line   : 188
    <356>   DW_AT_decl_column : 45
    <357>   DW_AT_artificial  : 1
    <357>   DW_AT_sibling     : <0x3aa>
 <2><35b>: Abbrev Number: 13 (DW_TAG_member)
    <35c>   DW_AT_name        : (indirect string, offset: 0x1a3c): size
    <360>   DW_AT_decl_file   : 2
    <361>   DW_AT_decl_line   : 188
    <362>   DW_AT_decl_column : 45
    <363>   DW_AT_type        : <0x7e>
    <367>   DW_AT_data_member_location: 0
 <2><368>: Abbrev Number: 15 (DW_TAG_member)
    <369>   DW_AT_name        : top
    <36d>   DW_AT_decl_file   : 2
    <36e>   DW_AT_decl_line   : 188
    <36f>   DW_AT_decl_column : 45
    <370>   DW_AT_type        : <0x9d>
    <374>   DW_AT_data_member_location: 0
 <2><375>: Abbrev Number: 15 (DW_TAG_member)
    <376>   DW_AT_name        : max
    <37a>   DW_AT_decl_file   : 2
    <37b>   DW_AT_decl_line   : 188
    <37c>   DW_AT_decl_column : 45
    <37d>   DW_AT_type        : <0x9d>
    <381>   DW_AT_data_member_location: 0
 <2><382>: Abbrev Number: 13 (DW_TAG_member)
    <383>   DW_AT_name        : (indirect string, offset: 0x105b): current_chunk___XVA8
    <387>   DW_AT_decl_file   : 2
    <388>   DW_AT_decl_line   : 188
    <389>   DW_AT_decl_column : 45
    <38a>   DW_AT_type        : <0xb0>
    <38e>   DW_AT_data_member_location: 0
 <2><38f>: Abbrev Number: 13 (DW_TAG_member)
    <390>   DW_AT_name        : (indirect string, offset: 0x257): freeable
    <394>   DW_AT_decl_file   : 2
    <395>   DW_AT_decl_line   : 188
    <396>   DW_AT_decl_column : 45
    <397>   DW_AT_type        : <0x3aa>
    <39b>   DW_AT_data_member_location: 0
 <2><39c>: Abbrev Number: 13 (DW_TAG_member)
    <39d>   DW_AT_name        : (indirect string, offset: 0xa78): internal_chunk___XVL16
    <3a1>   DW_AT_decl_file   : 2
    <3a2>   DW_AT_decl_line   : 188
    <3a3>   DW_AT_decl_column : 45
    <3a4>   DW_AT_type        : <0x3b1>
    <3a8>   DW_AT_data_member_location: 0
 <2><3a9>: Abbrev Number: 0
 <1><3aa>: Abbrev Number: 5 (DW_TAG_base_type)
    <3ab>   DW_AT_byte_size   : 1
    <3ac>   DW_AT_encoding    : 2	(boolean)
    <3ad>   DW_AT_name        : (indirect string, offset: 0xea5): boolean
 <1><3b1>: Abbrev Number: 11 (DW_TAG_pointer_type)
    <3b2>   DW_AT_byte_size   : 8
    <3b3>   DW_AT_type        : <0x25e>
 <1><3b7>: Abbrev Number: 27 (DW_TAG_structure_type)
    <3b8>   DW_AT_name        : (indirect string, offset: 0x8a7): system__secondary_stack__ss_stack
    <3bc>   DW_AT_decl_file   : 2
    <3bd>   DW_AT_decl_line   : 171
    <3be>   DW_AT_decl_column : 9
    <3bf>   DW_AT_GNAT_descriptive_type: <0x34e>
    <3c3>   DW_AT_sibling     : <0x416>
 <2><3c7>: Abbrev Number: 13 (DW_TAG_member)
    <3c8>   DW_AT_name        : (indirect string, offset: 0x1a3c): size
    <3cc>   DW_AT_decl_file   : 2
    <3cd>   DW_AT_decl_line   : 43
    <3ce>   DW_AT_decl_column : 19
    <3cf>   DW_AT_type        : <0x7e>
    <3d3>   DW_AT_data_member_location: 0
 <2><3d4>: Abbrev Number: 15 (DW_TAG_member)
    <3d5>   DW_AT_name        : top
    <3d9>   DW_AT_decl_file   : 2
    <3da>   DW_AT_decl_line   : 172
    <3db>   DW_AT_decl_column : 7
    <3dc>   DW_AT_type        : <0x9d>
    <3e0>   DW_AT_data_member_location: 4
 <2><3e1>: Abbrev Number: 15 (DW_TAG_member)
    <3e2>   DW_AT_name        : max
    <3e6>   DW_AT_decl_file   : 2
    <3e7>   DW_AT_decl_line   : 176
    <3e8>   DW_AT_decl_column : 7
    <3e9>   DW_AT_type        : <0x9d>
    <3ed>   DW_AT_data_member_location: 8
 <2><3ee>: Abbrev Number: 13 (DW_TAG_member)
    <3ef>   DW_AT_name        : (indirect string, offset: 0x1cc9): current_chunk
    <3f3>   DW_AT_decl_file   : 2
    <3f4>   DW_AT_decl_line   : 182
    <3f5>   DW_AT_decl_column : 7
    <3f6>   DW_AT_type        : <0xb0>
    <3fa>   DW_AT_data_member_location: 16
 <2><3fb>: Abbrev Number: 13 (DW_TAG_member)
    <3fc>   DW_AT_name        : (indirect string, offset: 0x257): freeable
    <400>   DW_AT_decl_file   : 2
    <401>   DW_AT_decl_line   : 185
    <402>   DW_AT_decl_column : 7
    <403>   DW_AT_type        : <0x3aa>
    <407>   DW_AT_data_member_location: 24
 <2><408>: Abbrev Number: 13 (DW_TAG_member)
    <409>   DW_AT_name        : (indirect string, offset: 0x166e): internal_chunk
    <40d>   DW_AT_decl_file   : 2
    <40e>   DW_AT_decl_line   : 188
    <40f>   DW_AT_decl_column : 7
    <410>   DW_AT_type        : <0x25e>
    <414>   DW_AT_data_member_location: 32
 <2><415>: Abbrev Number: 0
 <1><416>: Abbrev Number: 28 (DW_TAG_structure_type)
    <417>   DW_AT_name        : (indirect string, offset: 0x155a): ada_main__Tsec_default_sized_stacksC
    <41b>   DW_AT_byte_size   : 10304
    <41d>   DW_AT_decl_file   : 1
    <41e>   DW_AT_decl_line   : 24
    <41f>   DW_AT_decl_column : 4
    <420>   DW_AT_GNAT_descriptive_type: <0x51c>
    <424>   DW_AT_artificial  : 1
    <424>   DW_AT_sibling     : <0x51c>
 <2><428>: Abbrev Number: 13 (DW_TAG_member)
    <429>   DW_AT_name        : (indirect string, offset: 0x1a3c): size
    <42d>   DW_AT_decl_file   : 4
    <42e>   DW_AT_decl_line   : 92
    <42f>   DW_AT_decl_column : 62
    <430>   DW_AT_type        : <0x7e>
    <434>   DW_AT_data_member_location: 0
 <2><435>: Abbrev Number: 15 (DW_TAG_member)
    <436>   DW_AT_name        : top
    <43a>   DW_AT_decl_file   : 4
    <43b>   DW_AT_decl_line   : 92
    <43c>   DW_AT_decl_column : 62
    <43d>   DW_AT_type        : <0x9d>
    <441>   DW_AT_data_member_location: 4
 <2><442>: Abbrev Number: 15 (DW_TAG_member)
    <443>   DW_AT_name        : max
    <447>   DW_AT_decl_file   : 4
    <448>   DW_AT_decl_line   : 92
    <449>   DW_AT_decl_column : 62
    <44a>   DW_AT_type        : <0x9d>
    <44e>   DW_AT_data_member_location: 8
 <2><44f>: Abbrev Number: 13 (DW_TAG_member)
    <450>   DW_AT_name        : (indirect string, offset: 0x1cc9): current_chunk
    <454>   DW_AT_decl_file   : 4
    <455>   DW_AT_decl_line   : 92
    <456>   DW_AT_decl_column : 62
    <457>   DW_AT_type        : <0xb0>
    <45b>   DW_AT_data_member_location: 16
 <2><45c>: Abbrev Number: 13 (DW_TAG_member)
    <45d>   DW_AT_name        : (indirect string, offset: 0x257): freeable
    <461>   DW_AT_decl_file   : 4
    <462>   DW_AT_decl_line   : 92
    <463>   DW_AT_decl_column : 62
    <464>   DW_AT_type        : <0x3aa>
    <468>   DW_AT_data_member_location: 24
 <2><469>: Abbrev Number: 28 (DW_TAG_structure_type)
    <46a>   DW_AT_name        : (indirect string, offset: 0x1884): ada_main__Tsec_default_sized_stacksC__T15b
    <46e>   DW_AT_byte_size   : 10272
    <470>   DW_AT_decl_file   : 1
    <471>   DW_AT_decl_line   : 24
    <472>   DW_AT_decl_column : 4
    <473>   DW_AT_GNAT_descriptive_type: <0x4f3>
    <477>   DW_AT_artificial  : 1
    <477>   DW_AT_sibling     : <0x4f3>
 <3><47b>: Abbrev Number: 13 (DW_TAG_member)
    <47c>   DW_AT_name        : (indirect string, offset: 0x18e0): first
    <480>   DW_AT_decl_file   : 1
    <481>   DW_AT_decl_line   : 24
    <482>   DW_AT_decl_column : 107
    <483>   DW_AT_type        : <0x9d>
    <487>   DW_AT_data_member_location: 0
 <3><488>: Abbrev Number: 13 (DW_TAG_member)
    <489>   DW_AT_name        : (indirect string, offset: 0x1217): last
    <48d>   DW_AT_decl_file   : 1
    <48e>   DW_AT_decl_line   : 24
    <48f>   DW_AT_decl_column : 107
    <490>   DW_AT_type        : <0x9d>
    <494>   DW_AT_data_member_location: 4
 <3><495>: Abbrev Number: 13 (DW_TAG_member)
    <496>   DW_AT_name        : (indirect string, offset: 0x49a): prev
    <49a>   DW_AT_decl_file   : 1
    <49b>   DW_AT_decl_line   : 24
    <49c>   DW_AT_decl_column : 107
    <49d>   DW_AT_type        : <0xb0>
    <4a1>   DW_AT_data_member_location: 8
 <3><4a2>: Abbrev Number: 13 (DW_TAG_member)
    <4a3>   DW_AT_name        : (indirect string, offset: 0x260): next
    <4a7>   DW_AT_decl_file   : 1
    <4a8>   DW_AT_decl_line   : 24
    <4a9>   DW_AT_decl_column : 107
    <4aa>   DW_AT_type        : <0xb0>
    <4ae>   DW_AT_data_member_location: 16
 <3><4af>: Abbrev Number: 29 (DW_TAG_structure_type)
    <4b0>   DW_AT_name        : (indirect string, offset: 0x49f): ada_main__Tsec_default_sized_stacksC__T15b__T16b___PAD
    <4b4>   DW_AT_byte_size   : 10240
    <4b6>   DW_AT_alignment   : 16
    <4b7>   DW_AT_decl_file   : 1
    <4b8>   DW_AT_decl_line   : 24
    <4b9>   DW_AT_decl_column : 4
    <4ba>   DW_AT_artificial  : 1
    <4ba>   DW_AT_sibling     : <0x4ca>
 <4><4be>: Abbrev Number: 15 (DW_TAG_member)
    <4bf>   DW_AT_name        : F
    <4c1>   DW_AT_decl_file   : 1
    <4c2>   DW_AT_decl_line   : 24
    <4c3>   DW_AT_decl_column : 107
    <4c4>   DW_AT_type        : <0x4ca>
    <4c8>   DW_AT_data_member_location: 0
 <4><4c9>: Abbrev Number: 0
 <3><4ca>: Abbrev Number: 16 (DW_TAG_array_type)
    <4cb>   DW_AT_name        : (indirect string, offset: 0x6b4): ada_main__Tsec_default_sized_stacksC__T15b__T16b
    <4cf>   DW_AT_GNAT_descriptive_type: <0x18c>
    <4d3>   DW_AT_type        : <0x1f0>
    <4d7>   DW_AT_sibling     : <0x4e4>
 <4><4db>: Abbrev Number: 3 (DW_TAG_subrange_type)
    <4dc>   DW_AT_type        : <0x96>
    <4e0>   DW_AT_upper_bound : 10240
 <4><4e3>: Abbrev Number: 0
 <3><4e4>: Abbrev Number: 21 (DW_TAG_member)
    <4e5>   DW_AT_name        : mem
    <4e9>   DW_AT_decl_file   : 1
    <4ea>   DW_AT_decl_line   : 24
    <4eb>   DW_AT_decl_column : 107
    <4ec>   DW_AT_type        : <0x4af>
    <4f0>   DW_AT_alignment   : 16
    <4f1>   DW_AT_data_member_location: 32
 <3><4f2>: Abbrev Number: 0
 <2><4f3>: Abbrev Number: 23 (DW_TAG_structure_type)
    <4f4>   DW_AT_name        : (indirect string, offset: 0x8eb): ada_main__Tsec_default_sized_stacksC__T15b___XVS
    <4f8>   DW_AT_byte_size   : 8
    <4f9>   DW_AT_decl_file   : 1
    <4fa>   DW_AT_decl_line   : 24
    <4fb>   DW_AT_decl_column : 107
    <4fc>   DW_AT_artificial  : 1
    <4fc>   DW_AT_sibling     : <0x50e>
 <3><500>: Abbrev Number: 13 (DW_TAG_member)
    <501>   DW_AT_name        : (indirect string, offset: 0x192a): system__secondary_stack__chunk_id
    <505>   DW_AT_decl_file   : 1
    <506>   DW_AT_decl_line   : 24
    <507>   DW_AT_decl_column : 107
    <508>   DW_AT_type        : <0x348>
    <50c>   DW_AT_data_member_location: 0
 <3><50d>: Abbrev Number: 0
 <2><50e>: Abbrev Number: 13 (DW_TAG_member)
    <50f>   DW_AT_name        : (indirect string, offset: 0x166e): internal_chunk
    <513>   DW_AT_decl_file   : 1
    <514>   DW_AT_decl_line   : 24
    <515>   DW_AT_decl_column : 107
    <516>   DW_AT_type        : <0x469>
    <51a>   DW_AT_data_member_location: 32
 <2><51b>: Abbrev Number: 0
 <1><51c>: Abbrev Number: 23 (DW_TAG_structure_type)
    <51d>   DW_AT_name        : (indirect string, offset: 0x178d): ada_main__Tsec_default_sized_stacksC___XVS
    <521>   DW_AT_byte_size   : 8
    <522>   DW_AT_decl_file   : 1
    <523>   DW_AT_decl_line   : 24
    <524>   DW_AT_decl_column : 107
    <525>   DW_AT_artificial  : 1
    <525>   DW_AT_sibling     : <0x537>
 <2><529>: Abbrev Number: 13 (DW_TAG_member)
    <52a>   DW_AT_name        : (indirect string, offset: 0x8a7): system__secondary_stack__ss_stack
    <52e>   DW_AT_decl_file   : 1
    <52f>   DW_AT_decl_line   : 24
    <530>   DW_AT_decl_column : 107
    <531>   DW_AT_type        : <0x537>
    <535>   DW_AT_data_member_location: 0
 <2><536>: Abbrev Number: 0
 <1><537>: Abbrev Number: 25 (DW_TAG_reference_type)
    <538>   DW_AT_byte_size   : 8
    <539>   DW_AT_type        : <0x3b7>
 <1><53d>: Abbrev Number: 2 (DW_TAG_array_type)
    <53e>   DW_AT_name        : (indirect string, offset: 0x15d4): ada_main__Tsec_default_sized_stacksT
    <542>   DW_AT_type        : <0x416>
    <546>   DW_AT_sibling     : <0x551>
 <2><54a>: Abbrev Number: 3 (DW_TAG_subrange_type)
    <54b>   DW_AT_type        : <0x46>
    <54f>   DW_AT_upper_bound : 1
 <2><550>: Abbrev Number: 0
 <1><551>: Abbrev Number: 2 (DW_TAG_array_type)
    <552>   DW_AT_name        : (indirect string, offset: 0x150a): ada_main__Tlocal_priority_specific_dispatchingS
    <556>   DW_AT_type        : <0x4d>
    <55a>   DW_AT_sibling     : <0x565>
 <2><55e>: Abbrev Number: 3 (DW_TAG_subrange_type)
    <55f>   DW_AT_type        : <0x46>
    <563>   DW_AT_upper_bound : 0
 <2><564>: Abbrev Number: 0
 <1><565>: Abbrev Number: 23 (DW_TAG_structure_type)
    <566>   DW_AT_name        : (indirect string, offset: 0xf73): ada_main__local_priority_specific_dispatching___PAD
    <56a>   DW_AT_byte_size   : 1
    <56b>   DW_AT_decl_file   : 1
    <56c>   DW_AT_decl_line   : 26
    <56d>   DW_AT_decl_column : 4
    <56e>   DW_AT_artificial  : 1
    <56e>   DW_AT_sibling     : <0x57e>
 <2><572>: Abbrev Number: 15 (DW_TAG_member)
    <573>   DW_AT_name        : F
    <575>   DW_AT_decl_file   : 1
    <576>   DW_AT_decl_line   : 26
    <577>   DW_AT_decl_column : 4
    <578>   DW_AT_type        : <0x551>
    <57c>   DW_AT_data_member_location: 0
 <2><57d>: Abbrev Number: 0
 <1><57e>: Abbrev Number: 4 (DW_TAG_const_type)
    <57f>   DW_AT_type        : <0x565>
    <583>   DW_AT_artificial  : 1
 <1><583>: Abbrev Number: 2 (DW_TAG_array_type)
    <584>   DW_AT_name        : (indirect string, offset: 0x2a2): ada_main__Tlocal_interrupt_statesS
    <588>   DW_AT_type        : <0x4d>
    <58c>   DW_AT_sibling     : <0x597>
 <2><590>: Abbrev Number: 3 (DW_TAG_subrange_type)
    <591>   DW_AT_type        : <0x46>
    <595>   DW_AT_upper_bound : 0
 <2><596>: Abbrev Number: 0
 <1><597>: Abbrev Number: 23 (DW_TAG_structure_type)
    <598>   DW_AT_name        : (indirect string, offset: 0x172): ada_main__local_interrupt_states___PAD
    <59c>   DW_AT_byte_size   : 1
    <59d>   DW_AT_decl_file   : 1
    <59e>   DW_AT_decl_line   : 27
    <59f>   DW_AT_decl_column : 4
    <5a0>   DW_AT_artificial  : 1
    <5a0>   DW_AT_sibling     : <0x5b0>
 <2><5a4>: Abbrev Number: 15 (DW_TAG_member)
    <5a5>   DW_AT_name        : F
    <5a7>   DW_AT_decl_file   : 1
    <5a8>   DW_AT_decl_line   : 27
    <5a9>   DW_AT_decl_column : 4
    <5aa>   DW_AT_type        : <0x583>
    <5ae>   DW_AT_data_member_location: 0
 <2><5af>: Abbrev Number: 0
 <1><5b0>: Abbrev Number: 4 (DW_TAG_const_type)
    <5b1>   DW_AT_type        : <0x597>
    <5b5>   DW_AT_artificial  : 1
 <1><5b5>: Abbrev Number: 30 (DW_TAG_subroutine_type)
 <1><5b6>: Abbrev Number: 10 (DW_TAG_typedef)
    <5b7>   DW_AT_name        : (indirect string, offset: 0x300): ada_main__no_param_proc
    <5bb>   DW_AT_decl_file   : 1
    <5bc>   DW_AT_decl_line   : 47
    <5bd>   DW_AT_decl_column : 9
    <5be>   DW_AT_type        : <0x5c7>
 <1><5c2>: Abbrev Number: 6 (DW_TAG_volatile_type)
    <5c3>   DW_AT_type        : <0x5b6>
 <1><5c7>: Abbrev Number: 11 (DW_TAG_pointer_type)
    <5c8>   DW_AT_byte_size   : 8
    <5c9>   DW_AT_type        : <0x5b5>
 <1><5cd>: Abbrev Number: 5 (DW_TAG_base_type)
    <5ce>   DW_AT_byte_size   : 8
    <5cf>   DW_AT_encoding    : 7	(unsigned)
    <5d0>   DW_AT_name        : (indirect string, offset: 0x73): system__address
 <1><5d4>: Abbrev Number: 6 (DW_TAG_volatile_type)
    <5d5>   DW_AT_type        : <0x5cd>
 <1><5d9>: Abbrev Number: 31 (DW_TAG_subprogram)
    <5da>   DW_AT_external    : 1
    <5da>   DW_AT_name        : (indirect string, offset: 0xc1): ada_main__ada_main_program
    <5de>   DW_AT_decl_file   : 1
    <5df>   DW_AT_decl_line   : 156
    <5e0>   DW_AT_decl_column : 14
    <5e1>   DW_AT_linkage_name: (indirect string, offset: 0xaa4): _ada_add_int
 <1><5e5>: Abbrev Number: 32 (DW_TAG_variable)
    <5e6>   DW_AT_name        : (indirect string, offset: 0x1168): ada_main__gnat_argc
    <5ea>   DW_AT_decl_file   : 5
    <5eb>   DW_AT_decl_line   : 8
    <5ec>   DW_AT_decl_column : 4
    <5ed>   DW_AT_linkage_name: (indirect string, offset: 0x1172): gnat_argc
    <5f1>   DW_AT_type        : <0x633>
    <5f5>   DW_AT_external    : 1
    <5f5>   DW_AT_declaration : 1
 <1><5f5>: Abbrev Number: 9 (DW_TAG_base_type)
    <5f6>   DW_AT_byte_size   : 4
    <5f7>   DW_AT_encoding    : 5	(signed)
    <5f8>   DW_AT_name        : (indirect string, offset: 0x1666): integer
    <5fc>   DW_AT_artificial  : 1
 <1><5fc>: Abbrev Number: 33 (DW_TAG_volatile_type)
    <5fd>   DW_AT_type        : <0x5f5>
    <601>   DW_AT_artificial  : 1
 <1><601>: Abbrev Number: 33 (DW_TAG_volatile_type)
    <602>   DW_AT_type        : <0x5f5>
    <606>   DW_AT_artificial  : 1
 <1><606>: Abbrev Number: 33 (DW_TAG_volatile_type)
    <607>   DW_AT_type        : <0x5f5>
    <60b>   DW_AT_artificial  : 1
 <1><60b>: Abbrev Number: 33 (DW_TAG_volatile_type)
    <60c>   DW_AT_type        : <0x5f5>
    <610>   DW_AT_artificial  : 1
 <1><610>: Abbrev Number: 33 (DW_TAG_volatile_type)
    <611>   DW_AT_type        : <0x5f5>
    <615>   DW_AT_artificial  : 1
 <1><615>: Abbrev Number: 33 (DW_TAG_volatile_type)
    <616>   DW_AT_type        : <0x5f5>
    <61a>   DW_AT_artificial  : 1
 <1><61a>: Abbrev Number: 33 (DW_TAG_volatile_type)
    <61b>   DW_AT_type        : <0x5f5>
    <61f>   DW_AT_artificial  : 1
 <1><61f>: Abbrev Number: 33 (DW_TAG_volatile_type)
    <620>   DW_AT_type        : <0x5f5>
    <624>   DW_AT_artificial  : 1
 <1><624>: Abbrev Number: 33 (DW_TAG_volatile_type)
    <625>   DW_AT_type        : <0x5f5>
    <629>   DW_AT_artificial  : 1
 <1><629>: Abbrev Number: 4 (DW_TAG_const_type)
    <62a>   DW_AT_type        : <0x5f5>
    <62e>   DW_AT_artificial  : 1
 <1><62e>: Abbrev Number: 33 (DW_TAG_volatile_type)
    <62f>   DW_AT_type        : <0x5f5>
    <633>   DW_AT_artificial  : 1
 <1><633>: Abbrev Number: 33 (DW_TAG_volatile_type)
    <634>   DW_AT_type        : <0x5f5>
    <638>   DW_AT_artificial  : 1
 <1><638>: Abbrev Number: 32 (DW_TAG_variable)
    <639>   DW_AT_name        : (indirect string, offset: 0x11ce): ada_main__gnat_argv
    <63d>   DW_AT_decl_file   : 5
    <63e>   DW_AT_decl_line   : 9
    <63f>   DW_AT_decl_column : 4
    <640>   DW_AT_linkage_name: (indirect string, offset: 0x11d8): gnat_argv
    <644>   DW_AT_type        : <0x64a>
    <648>   DW_AT_external    : 1
    <648>   DW_AT_declaration : 1
 <1><648>: Abbrev Number: 34 (DW_TAG_pointer_type)
    <649>   DW_AT_byte_size   : 8
 <1><64a>: Abbrev Number: 6 (DW_TAG_volatile_type)
    <64b>   DW_AT_type        : <0x648>
 <1><64f>: Abbrev Number: 7 (DW_TAG_const_type)
    <650>   DW_AT_type        : <0x648>
 <1><654>: Abbrev Number: 32 (DW_TAG_variable)
    <655>   DW_AT_name        : (indirect string, offset: 0x893): ada_main__gnat_envp
    <659>   DW_AT_decl_file   : 5
    <65a>   DW_AT_decl_line   : 10
    <65b>   DW_AT_decl_column : 4
    <65c>   DW_AT_linkage_name: (indirect string, offset: 0x89d): gnat_envp
    <660>   DW_AT_type        : <0x64a>
    <664>   DW_AT_external    : 1
    <664>   DW_AT_declaration : 1
 <1><664>: Abbrev Number: 32 (DW_TAG_variable)
    <665>   DW_AT_name        : (indirect string, offset: 0xbee): ada_main__gnat_exit_status
    <669>   DW_AT_decl_file   : 5
    <66a>   DW_AT_decl_line   : 16
    <66b>   DW_AT_decl_column : 4
    <66c>   DW_AT_linkage_name: (indirect string, offset: 0xbf8): gnat_exit_status
    <670>   DW_AT_type        : <0x62e>
    <674>   DW_AT_external    : 1
    <674>   DW_AT_declaration : 1
 <1><674>: Abbrev Number: 35 (DW_TAG_variable)
    <675>   DW_AT_name        : (indirect string, offset: 0x134d): ada_main__gnat_version
    <679>   DW_AT_decl_file   : 5
    <67a>   DW_AT_decl_line   : 19
    <67b>   DW_AT_decl_column : 4
    <67c>   DW_AT_linkage_name: (indirect string, offset: 0x1355): __gnat_version
    <680>   DW_AT_type        : <0x41>
    <684>   DW_AT_external    : 1
    <684>   DW_AT_location    : 9 byte block: 3 20 30 0 0 0 0 0 0 	(DW_OP_addr: 3020)
 <1><68e>: Abbrev Number: 35 (DW_TAG_variable)
    <68f>   DW_AT_name        : (indirect string, offset: 0x13ef): ada_main__ada_main_program_name
    <693>   DW_AT_decl_file   : 5
    <694>   DW_AT_decl_line   : 23
    <695>   DW_AT_decl_column : 4
    <696>   DW_AT_linkage_name: (indirect string, offset: 0x1c0): __gnat_ada_main_program_name
    <69a>   DW_AT_type        : <0x6d>
    <69e>   DW_AT_external    : 1
    <69e>   DW_AT_location    : 9 byte block: 3 38 30 0 0 0 0 0 0 	(DW_OP_addr: 3038)
 <1><6a8>: Abbrev Number: 35 (DW_TAG_variable)
    <6a9>   DW_AT_name        : (indirect string, offset: 0x18e6): ada_main__u00001
    <6ad>   DW_AT_decl_file   : 5
    <6ae>   DW_AT_decl_line   : 40
    <6af>   DW_AT_decl_column : 4
    <6b0>   DW_AT_linkage_name: (indirect string, offset: 0x1501): add_intB
    <6b4>   DW_AT_type        : <0x79>
    <6b8>   DW_AT_external    : 1
    <6b8>   DW_AT_location    : 9 byte block: 3 48 30 0 0 0 0 0 0 	(DW_OP_addr: 3048)
 <1><6c2>: Abbrev Number: 35 (DW_TAG_variable)
    <6c3>   DW_AT_name        : (indirect string, offset: 0x18f7): ada_main__u00002
    <6c7>   DW_AT_decl_file   : 5
    <6c8>   DW_AT_decl_line   : 42
    <6c9>   DW_AT_decl_column : 4
    <6ca>   DW_AT_linkage_name: (indirect string, offset: 0x63a): system__standard_libraryB
    <6ce>   DW_AT_type        : <0x79>
    <6d2>   DW_AT_external    : 1
    <6d2>   DW_AT_location    : 9 byte block: 3 4c 30 0 0 0 0 0 0 	(DW_OP_addr: 304c)
 <1><6dc>: Abbrev Number: 35 (DW_TAG_variable)
    <6dd>   DW_AT_name        : (indirect string, offset: 0x1908): ada_main__u00003
    <6e1>   DW_AT_decl_file   : 5
    <6e2>   DW_AT_decl_line   : 44
    <6e3>   DW_AT_decl_column : 4
    <6e4>   DW_AT_linkage_name: (indirect string, offset: 0x711): system__standard_libraryS
    <6e8>   DW_AT_type        : <0x79>
    <6ec>   DW_AT_external    : 1
    <6ec>   DW_AT_location    : 9 byte block: 3 50 30 0 0 0 0 0 0 	(DW_OP_addr: 3050)
 <1><6f6>: Abbrev Number: 35 (DW_TAG_variable)
    <6f7>   DW_AT_name        : (indirect string, offset: 0x1919): ada_main__u00004
    <6fb>   DW_AT_decl_file   : 5
    <6fc>   DW_AT_decl_line   : 46
    <6fd>   DW_AT_decl_column : 4
    <6fe>   DW_AT_linkage_name: (indirect string, offset: 0x139b): gnatS
    <702>   DW_AT_type        : <0x79>
    <706>   DW_AT_external    : 1
    <706>   DW_AT_location    : 9 byte block: 3 54 30 0 0 0 0 0 0 	(DW_OP_addr: 3054)
 <1><710>: Abbrev Number: 35 (DW_TAG_variable)
    <711>   DW_AT_name        : (indirect string, offset: 0x100): ada_main__u00005
    <715>   DW_AT_decl_file   : 5
    <716>   DW_AT_decl_line   : 48
    <717>   DW_AT_decl_column : 4
    <718>   DW_AT_linkage_name: (indirect string, offset: 0x10a9): gnat__ioB
    <71c>   DW_AT_type        : <0x79>
    <720>   DW_AT_external    : 1
    <720>   DW_AT_location    : 9 byte block: 3 58 30 0 0 0 0 0 0 	(DW_OP_addr: 3058)
 <1><72a>: Abbrev Number: 35 (DW_TAG_variable)
    <72b>   DW_AT_name        : (indirect string, offset: 0x194c): ada_main__u00006
    <72f>   DW_AT_decl_file   : 5
    <730>   DW_AT_decl_line   : 50
    <731>   DW_AT_decl_column : 4
    <732>   DW_AT_linkage_name: (indirect string, offset: 0x1126): gnat__ioS
    <736>   DW_AT_type        : <0x79>
    <73a>   DW_AT_external    : 1
    <73a>   DW_AT_location    : 9 byte block: 3 5c 30 0 0 0 0 0 0 	(DW_OP_addr: 305c)
 <1><744>: Abbrev Number: 35 (DW_TAG_variable)
    <745>   DW_AT_name        : (indirect string, offset: 0x14e): ada_main__u00007
    <749>   DW_AT_decl_file   : 5
    <74a>   DW_AT_decl_line   : 52
    <74b>   DW_AT_decl_column : 4
    <74c>   DW_AT_linkage_name: (indirect string, offset: 0x3d): systemS
    <750>   DW_AT_type        : <0x79>
    <754>   DW_AT_external    : 1
    <754>   DW_AT_location    : 9 byte block: 3 60 30 0 0 0 0 0 0 	(DW_OP_addr: 3060)
 <1><75e>: Abbrev Number: 35 (DW_TAG_variable)
    <75f>   DW_AT_name        : (indirect string, offset: 0x1985): ada_main__u00008
    <763>   DW_AT_decl_file   : 5
    <764>   DW_AT_decl_line   : 54
    <765>   DW_AT_decl_column : 4
    <766>   DW_AT_linkage_name: (indirect string, offset: 0x1c96): system__memoryB
    <76a>   DW_AT_type        : <0x79>
    <76e>   DW_AT_external    : 1
    <76e>   DW_AT_location    : 9 byte block: 3 64 30 0 0 0 0 0 0 	(DW_OP_addr: 3064)
 <1><778>: Abbrev Number: 35 (DW_TAG_variable)
    <779>   DW_AT_name        : (indirect string, offset: 0x1996): ada_main__u00009
    <77d>   DW_AT_decl_file   : 5
    <77e>   DW_AT_decl_line   : 56
    <77f>   DW_AT_decl_column : 4
    <780>   DW_AT_linkage_name: (indirect string, offset: 0x1d19): system__memoryS
    <784>   DW_AT_type        : <0x79>
    <788>   DW_AT_external    : 1
    <788>   DW_AT_location    : 9 byte block: 3 68 30 0 0 0 0 0 0 	(DW_OP_addr: 3068)
 <1><792>: Abbrev Number: 35 (DW_TAG_variable)
    <793>   DW_AT_name        : (indirect string, offset: 0x1b69): ada_main__u00010
    <797>   DW_AT_decl_file   : 5
    <798>   DW_AT_decl_line   : 58
    <799>   DW_AT_decl_column : 4
    <79a>   DW_AT_linkage_name: (indirect string, offset: 0x5f6): ada__exceptionsB
    <79e>   DW_AT_type        : <0x79>
    <7a2>   DW_AT_external    : 1
    <7a2>   DW_AT_location    : 9 byte block: 3 6c 30 0 0 0 0 0 0 	(DW_OP_addr: 306c)
 <1><7ac>: Abbrev Number: 35 (DW_TAG_variable)
    <7ad>   DW_AT_name        : (indirect string, offset: 0x1b7a): ada_main__u00011
    <7b1>   DW_AT_decl_file   : 5
    <7b2>   DW_AT_decl_line   : 60
    <7b3>   DW_AT_decl_column : 4
    <7b4>   DW_AT_linkage_name: (indirect string, offset: 0x654): ada__exceptionsS
    <7b8>   DW_AT_type        : <0x79>
    <7bc>   DW_AT_external    : 1
    <7bc>   DW_AT_location    : 9 byte block: 3 70 30 0 0 0 0 0 0 	(DW_OP_addr: 3070)
 <1><7c6>: Abbrev Number: 35 (DW_TAG_variable)
    <7c7>   DW_AT_name        : (indirect string, offset: 0x511): ada_main__u00012
    <7cb>   DW_AT_decl_file   : 5
    <7cc>   DW_AT_decl_line   : 62
    <7cd>   DW_AT_decl_column : 4
    <7ce>   DW_AT_linkage_name: (indirect string, offset: 0x12d3): adaS
    <7d2>   DW_AT_type        : <0x79>
    <7d6>   DW_AT_external    : 1
    <7d6>   DW_AT_location    : 9 byte block: 3 74 30 0 0 0 0 0 0 	(DW_OP_addr: 3074)
 <1><7e0>: Abbrev Number: 35 (DW_TAG_variable)
    <7e1>   DW_AT_name        : (indirect string, offset: 0x1bad): ada_main__u00013
    <7e5>   DW_AT_decl_file   : 5
    <7e6>   DW_AT_decl_line   : 64
    <7e7>   DW_AT_decl_column : 4
    <7e8>   DW_AT_linkage_name: (indirect string, offset: 0x265): ada__exceptions__last_chance_handlerB
    <7ec>   DW_AT_type        : <0x79>
    <7f0>   DW_AT_external    : 1
    <7f0>   DW_AT_location    : 9 byte block: 3 78 30 0 0 0 0 0 0 	(DW_OP_addr: 3078)
 <1><7fa>: Abbrev Number: 35 (DW_TAG_variable)
    <7fb>   DW_AT_name        : (indirect string, offset: 0x1bbe): ada_main__u00014
    <7ff>   DW_AT_decl_file   : 5
    <800>   DW_AT_decl_line   : 66
    <801>   DW_AT_decl_column : 4
    <802>   DW_AT_linkage_name: (indirect string, offset: 0x318): ada__exceptions__last_chance_handlerS
    <806>   DW_AT_type        : <0x79>
    <80a>   DW_AT_external    : 1
    <80a>   DW_AT_location    : 9 byte block: 3 7c 30 0 0 0 0 0 0 	(DW_OP_addr: 307c)
 <1><814>: Abbrev Number: 35 (DW_TAG_variable)
    <815>   DW_AT_name        : (indirect string, offset: 0x1bcf): ada_main__u00015
    <819>   DW_AT_decl_file   : 5
    <81a>   DW_AT_decl_line   : 68
    <81b>   DW_AT_decl_column : 4
    <81c>   DW_AT_linkage_name: (indirect string, offset: 0x164c): system__soft_linksB
    <820>   DW_AT_type        : <0x79>
    <824>   DW_AT_external    : 1
    <824>   DW_AT_location    : 9 byte block: 3 80 30 0 0 0 0 0 0 	(DW_OP_addr: 3080)
 <1><82e>: Abbrev Number: 35 (DW_TAG_variable)
    <82f>   DW_AT_name        : (indirect string, offset: 0x535): ada_main__u00016
    <833>   DW_AT_decl_file   : 5
    <834>   DW_AT_decl_line   : 70
    <835>   DW_AT_decl_column : 4
    <836>   DW_AT_linkage_name: (indirect string, offset: 0x16d2): system__soft_linksS
    <83a>   DW_AT_type        : <0x79>
    <83e>   DW_AT_external    : 1
    <83e>   DW_AT_location    : 9 byte block: 3 84 30 0 0 0 0 0 0 	(DW_OP_addr: 3084)
 <1><848>: Abbrev Number: 35 (DW_TAG_variable)
    <849>   DW_AT_name        : (indirect string, offset: 0x1c06): ada_main__u00017
    <84d>   DW_AT_decl_file   : 5
    <84e>   DW_AT_decl_line   : 72
    <84f>   DW_AT_decl_column : 4
    <850>   DW_AT_linkage_name: (indirect string, offset: 0x68a): system__secondary_stackB
    <854>   DW_AT_type        : <0x79>
    <858>   DW_AT_external    : 1
    <858>   DW_AT_location    : 9 byte block: 3 88 30 0 0 0 0 0 0 	(DW_OP_addr: 3088)
 <1><862>: Abbrev Number: 35 (DW_TAG_variable)
    <863>   DW_AT_name        : (indirect string, offset: 0x1c17): ada_main__u00018
    <867>   DW_AT_decl_file   : 5
    <868>   DW_AT_decl_line   : 74
    <869>   DW_AT_decl_column : 4
    <86a>   DW_AT_linkage_name: (indirect string, offset: 0x766): system__secondary_stackS
    <86e>   DW_AT_type        : <0x79>
    <872>   DW_AT_external    : 1
    <872>   DW_AT_location    : 9 byte block: 3 8c 30 0 0 0 0 0 0 	(DW_OP_addr: 308c)
 <1><87c>: Abbrev Number: 35 (DW_TAG_variable)
    <87d>   DW_AT_name        : (indirect string, offset: 0x1c28): ada_main__u00019
    <881>   DW_AT_decl_file   : 5
    <882>   DW_AT_decl_line   : 76
    <883>   DW_AT_decl_column : 4
    <884>   DW_AT_linkage_name: (indirect string, offset: 0x557): system__parametersB
    <888>   DW_AT_type        : <0x79>
    <88c>   DW_AT_external    : 1
    <88c>   DW_AT_location    : 9 byte block: 3 90 30 0 0 0 0 0 0 	(DW_OP_addr: 3090)
 <1><896>: Abbrev Number: 35 (DW_TAG_variable)
    <897>   DW_AT_name        : (indirect string, offset: 0x1dac): ada_main__u00020
    <89b>   DW_AT_decl_file   : 5
    <89c>   DW_AT_decl_line   : 78
    <89d>   DW_AT_decl_column : 4
    <89e>   DW_AT_linkage_name: (indirect string, offset: 0x1c82): system__parametersS
    <8a2>   DW_AT_type        : <0x79>
    <8a6>   DW_AT_external    : 1
    <8a6>   DW_AT_location    : 9 byte block: 3 94 30 0 0 0 0 0 0 	(DW_OP_addr: 3094)
 <1><8b0>: Abbrev Number: 35 (DW_TAG_variable)
    <8b1>   DW_AT_name        : (indirect string, offset: 0x1dbd): ada_main__u00021
    <8b5>   DW_AT_decl_file   : 5
    <8b6>   DW_AT_decl_line   : 80
    <8b7>   DW_AT_decl_column : 4
    <8b8>   DW_AT_linkage_name: (indirect string, offset: 0x1364): system__storage_elementsB
    <8bc>   DW_AT_type        : <0x79>
    <8c0>   DW_AT_external    : 1
    <8c0>   DW_AT_location    : 9 byte block: 3 98 30 0 0 0 0 0 0 	(DW_OP_addr: 3098)
 <1><8ca>: Abbrev Number: 35 (DW_TAG_variable)
    <8cb>   DW_AT_name        : (indirect string, offset: 0x1dce): ada_main__u00022
    <8cf>   DW_AT_decl_file   : 5
    <8d0>   DW_AT_decl_line   : 82
    <8d1>   DW_AT_decl_column : 4
    <8d2>   DW_AT_linkage_name: (indirect string, offset: 0x13c4): system__storage_elementsS
    <8d6>   DW_AT_type        : <0x79>
    <8da>   DW_AT_external    : 1
    <8da>   DW_AT_location    : 9 byte block: 3 9c 30 0 0 0 0 0 0 	(DW_OP_addr: 309c)
 <1><8e4>: Abbrev Number: 35 (DW_TAG_variable)
    <8e5>   DW_AT_name        : (indirect string, offset: 0x1ddf): ada_main__u00023
    <8e9>   DW_AT_decl_file   : 5
    <8ea>   DW_AT_decl_line   : 84
    <8eb>   DW_AT_decl_column : 4
    <8ec>   DW_AT_linkage_name: (indirect string, offset: 0x1263): system__soft_links__initializeB
    <8f0>   DW_AT_type        : <0x79>
    <8f4>   DW_AT_external    : 1
    <8f4>   DW_AT_location    : 9 byte block: 3 a0 30 0 0 0 0 0 0 	(DW_OP_addr: 30a0)
 <1><8fe>: Abbrev Number: 35 (DW_TAG_variable)
    <8ff>   DW_AT_name        : (indirect string, offset: 0x1df0): ada_main__u00024
    <903>   DW_AT_decl_file   : 5
    <904>   DW_AT_decl_line   : 86
    <905>   DW_AT_decl_column : 4
    <906>   DW_AT_linkage_name: (indirect string, offset: 0x12d8): system__soft_links__initializeS
    <90a>   DW_AT_type        : <0x79>
    <90e>   DW_AT_external    : 1
    <90e>   DW_AT_location    : 9 byte block: 3 a4 30 0 0 0 0 0 0 	(DW_OP_addr: 30a4)
 <1><918>: Abbrev Number: 35 (DW_TAG_variable)
    <919>   DW_AT_name        : (indirect string, offset: 0x1e01): ada_main__u00025
    <91d>   DW_AT_decl_file   : 5
    <91e>   DW_AT_decl_line   : 88
    <91f>   DW_AT_decl_column : 4
    <920>   DW_AT_linkage_name: (indirect string, offset: 0x1614): system__stack_checkingB
    <924>   DW_AT_type        : <0x79>
    <928>   DW_AT_external    : 1
    <928>   DW_AT_location    : 9 byte block: 3 a8 30 0 0 0 0 0 0 	(DW_OP_addr: 30a8)
 <1><932>: Abbrev Number: 35 (DW_TAG_variable)
    <933>   DW_AT_name        : (indirect string, offset: 0x1e12): ada_main__u00026
    <937>   DW_AT_decl_file   : 5
    <938>   DW_AT_decl_line   : 90
    <939>   DW_AT_decl_column : 4
    <93a>   DW_AT_linkage_name: (indirect string, offset: 0x167d): system__stack_checkingS
    <93e>   DW_AT_type        : <0x79>
    <942>   DW_AT_external    : 1
    <942>   DW_AT_location    : 9 byte block: 3 ac 30 0 0 0 0 0 0 	(DW_OP_addr: 30ac)
 <1><94c>: Abbrev Number: 35 (DW_TAG_variable)
    <94d>   DW_AT_name        : (indirect string, offset: 0x1e23): ada_main__u00027
    <951>   DW_AT_decl_file   : 5
    <952>   DW_AT_decl_line   : 92
    <953>   DW_AT_decl_column : 4
    <954>   DW_AT_linkage_name: (indirect string, offset: 0x18c7): system__exception_tableB
    <958>   DW_AT_type        : <0x79>
    <95c>   DW_AT_external    : 1
    <95c>   DW_AT_location    : 9 byte block: 3 b0 30 0 0 0 0 0 0 	(DW_OP_addr: 30b0)
 <1><966>: Abbrev Number: 35 (DW_TAG_variable)
    <967>   DW_AT_name        : (indirect string, offset: 0x1e34): ada_main__u00028
    <96b>   DW_AT_decl_file   : 5
    <96c>   DW_AT_decl_line   : 94
    <96d>   DW_AT_decl_column : 4
    <96e>   DW_AT_linkage_name: (indirect string, offset: 0x19db): system__exception_tableS
    <972>   DW_AT_type        : <0x79>
    <976>   DW_AT_external    : 1
    <976>   DW_AT_location    : 9 byte block: 3 b4 30 0 0 0 0 0 0 	(DW_OP_addr: 30b4)
 <1><980>: Abbrev Number: 35 (DW_TAG_variable)
    <981>   DW_AT_name        : (indirect string, offset: 0x1e45): ada_main__u00029
    <985>   DW_AT_decl_file   : 5
    <986>   DW_AT_decl_line   : 96
    <987>   DW_AT_decl_column : 4
    <988>   DW_AT_linkage_name: (indirect string, offset: 0x5e2): system__exceptionsB
    <98c>   DW_AT_type        : <0x79>
    <990>   DW_AT_external    : 1
    <990>   DW_AT_location    : 9 byte block: 3 b8 30 0 0 0 0 0 0 	(DW_OP_addr: 30b8)
 <1><99a>: Abbrev Number: 35 (DW_TAG_variable)
    <99b>   DW_AT_name        : (indirect string, offset: 0x1af): ada_main__u00030
    <99f>   DW_AT_decl_file   : 5
    <9a0>   DW_AT_decl_line   : 98
    <9a1>   DW_AT_decl_column : 4
    <9a2>   DW_AT_linkage_name: (indirect string, offset: 0x5f): system__exceptionsS
    <9a6>   DW_AT_type        : <0x79>
    <9aa>   DW_AT_external    : 1
    <9aa>   DW_AT_location    : 9 byte block: 3 bc 30 0 0 0 0 0 0 	(DW_OP_addr: 30bc)
 <1><9b4>: Abbrev Number: 35 (DW_TAG_variable)
    <9b5>   DW_AT_name        : (indirect string, offset: 0xca6): ada_main__u00031
    <9b9>   DW_AT_decl_file   : 5
    <9ba>   DW_AT_decl_line   : 100
    <9bb>   DW_AT_decl_column : 4
    <9bc>   DW_AT_linkage_name: (indirect string, offset: 0xe6c): system__exceptions__machineB
    <9c0>   DW_AT_type        : <0x79>
    <9c4>   DW_AT_external    : 1
    <9c4>   DW_AT_location    : 9 byte block: 3 c0 30 0 0 0 0 0 0 	(DW_OP_addr: 30c0)
 <1><9ce>: Abbrev Number: 35 (DW_TAG_variable)
    <9cf>   DW_AT_name        : (indirect string, offset: 0x16ae): ada_main__u00032
    <9d3>   DW_AT_decl_file   : 5
    <9d4>   DW_AT_decl_line   : 102
    <9d5>   DW_AT_decl_column : 4
    <9d6>   DW_AT_linkage_name: (indirect string, offset: 0xead): system__exceptions__machineS
    <9da>   DW_AT_type        : <0x79>
    <9de>   DW_AT_external    : 1
    <9de>   DW_AT_location    : 9 byte block: 3 c4 30 0 0 0 0 0 0 	(DW_OP_addr: 30c4)
 <1><9e8>: Abbrev Number: 35 (DW_TAG_variable)
    <9e9>   DW_AT_name        : (indirect string, offset: 0x1dd): ada_main__u00033
    <9ed>   DW_AT_decl_file   : 5
    <9ee>   DW_AT_decl_line   : 104
    <9ef>   DW_AT_decl_column : 4
    <9f0>   DW_AT_linkage_name: (indirect string, offset: 0x1c39): system__exceptions_debugB
    <9f4>   DW_AT_type        : <0x79>
    <9f8>   DW_AT_external    : 1
    <9f8>   DW_AT_location    : 9 byte block: 3 c8 30 0 0 0 0 0 0 	(DW_OP_addr: 30c8)
 <1><a02>: Abbrev Number: 35 (DW_TAG_variable)
    <a03>   DW_AT_name        : (indirect string, offset: 0x1ee): ada_main__u00034
    <a07>   DW_AT_decl_file   : 5
    <a08>   DW_AT_decl_line   : 106
    <a09>   DW_AT_decl_column : 4
    <a0a>   DW_AT_linkage_name: (indirect string, offset: 0x1d29): system__exceptions_debugS
    <a0e>   DW_AT_type        : <0x79>
    <a12>   DW_AT_external    : 1
    <a12>   DW_AT_location    : 9 byte block: 3 cc 30 0 0 0 0 0 0 	(DW_OP_addr: 30cc)
 <1><a1c>: Abbrev Number: 35 (DW_TAG_variable)
    <a1d>   DW_AT_name        : (indirect string, offset: 0xd1a): ada_main__u00035
    <a21>   DW_AT_decl_file   : 5
    <a22>   DW_AT_decl_line   : 108
    <a23>   DW_AT_decl_column : 4
    <a24>   DW_AT_linkage_name: (indirect string, offset: 0x83): system__img_intB
    <a28>   DW_AT_type        : <0x79>
    <a2c>   DW_AT_external    : 1
    <a2c>   DW_AT_location    : 9 byte block: 3 d0 30 0 0 0 0 0 0 	(DW_OP_addr: 30d0)
 <1><a36>: Abbrev Number: 35 (DW_TAG_variable)
    <a37>   DW_AT_name        : (indirect string, offset: 0x1ff): ada_main__u00036
    <a3b>   DW_AT_decl_file   : 5
    <a3c>   DW_AT_decl_line   : 110
    <a3d>   DW_AT_decl_column : 4
    <a3e>   DW_AT_linkage_name: (indirect string, offset: 0xef): system__img_intS
    <a42>   DW_AT_type        : <0x79>
    <a46>   DW_AT_external    : 1
    <a46>   DW_AT_location    : 9 byte block: 3 d4 30 0 0 0 0 0 0 	(DW_OP_addr: 30d4)
 <1><a50>: Abbrev Number: 35 (DW_TAG_variable)
    <a51>   DW_AT_name        : (indirect string, offset: 0x210): ada_main__u00037
    <a55>   DW_AT_decl_file   : 5
    <a56>   DW_AT_decl_line   : 112
    <a57>   DW_AT_decl_column : 4
    <a58>   DW_AT_linkage_name: (indirect string, offset: 0x36b): system__tracebackB
    <a5c>   DW_AT_type        : <0x79>
    <a60>   DW_AT_external    : 1
    <a60>   DW_AT_location    : 9 byte block: 3 d8 30 0 0 0 0 0 0 	(DW_OP_addr: 30d8)
 <1><a6a>: Abbrev Number: 35 (DW_TAG_variable)
    <a6b>   DW_AT_name        : (indirect string, offset: 0xd48): ada_main__u00038
    <a6f>   DW_AT_decl_file   : 5
    <a70>   DW_AT_decl_line   : 114
    <a71>   DW_AT_decl_column : 4
    <a72>   DW_AT_linkage_name: (indirect string, offset: 0x522): system__tracebackS
    <a76>   DW_AT_type        : <0x79>
    <a7a>   DW_AT_external    : 1
    <a7a>   DW_AT_location    : 9 byte block: 3 dc 30 0 0 0 0 0 0 	(DW_OP_addr: 30dc)
 <1><a84>: Abbrev Number: 35 (DW_TAG_variable)
    <a85>   DW_AT_name        : (indirect string, offset: 0x221): ada_main__u00039
    <a89>   DW_AT_decl_file   : 5
    <a8a>   DW_AT_decl_line   : 116
    <a8b>   DW_AT_decl_column : 4
    <a8c>   DW_AT_linkage_name: (indirect string, offset: 0x143d): system__traceback_entriesB
    <a90>   DW_AT_type        : <0x79>
    <a94>   DW_AT_external    : 1
    <a94>   DW_AT_location    : 9 byte block: 3 e0 30 0 0 0 0 0 0 	(DW_OP_addr: 30e0)
 <1><a9e>: Abbrev Number: 35 (DW_TAG_variable)
    <a9f>   DW_AT_name        : (indirect string, offset: 0x10cd): ada_main__u00040
    <aa3>   DW_AT_decl_file   : 5
    <aa4>   DW_AT_decl_line   : 118
    <aa5>   DW_AT_decl_column : 4
    <aa6>   DW_AT_linkage_name: (indirect string, offset: 0x14c6): system__traceback_entriesS
    <aaa>   DW_AT_type        : <0x79>
    <aae>   DW_AT_external    : 1
    <aae>   DW_AT_location    : 9 byte block: 3 e4 30 0 0 0 0 0 0 	(DW_OP_addr: 30e4)
 <1><ab8>: Abbrev Number: 35 (DW_TAG_variable)
    <ab9>   DW_AT_name        : (indirect string, offset: 0x10f5): ada_main__u00041
    <abd>   DW_AT_decl_file   : 5
    <abe>   DW_AT_decl_line   : 120
    <abf>   DW_AT_decl_column : 4
    <ac0>   DW_AT_linkage_name: (indirect string, offset: 0xd2b): system__traceback__symbolicB
    <ac4>   DW_AT_type        : <0x79>
    <ac8>   DW_AT_external    : 1
    <ac8>   DW_AT_location    : 9 byte block: 3 e8 30 0 0 0 0 0 0 	(DW_OP_addr: 30e8)
 <1><ad2>: Abbrev Number: 35 (DW_TAG_variable)
    <ad3>   DW_AT_name        : (indirect string, offset: 0x3d1): ada_main__u00042
    <ad7>   DW_AT_decl_file   : 5
    <ad8>   DW_AT_decl_line   : 122
    <ad9>   DW_AT_decl_column : 4
    <ada>   DW_AT_linkage_name: (indirect string, offset: 0x1312): system__traceback__symbolicS
    <ade>   DW_AT_type        : <0x79>
    <ae2>   DW_AT_external    : 1
    <ae2>   DW_AT_location    : 9 byte block: 3 ec 30 0 0 0 0 0 0 	(DW_OP_addr: 30ec)
 <1><aec>: Abbrev Number: 35 (DW_TAG_variable)
    <aed>   DW_AT_name        : (indirect string, offset: 0x3e2): ada_main__u00043
    <af1>   DW_AT_decl_file   : 5
    <af2>   DW_AT_decl_line   : 124
    <af3>   DW_AT_decl_column : 4
    <af4>   DW_AT_linkage_name: (indirect string, offset: 0x755): ada__containersS
    <af8>   DW_AT_type        : <0x79>
    <afc>   DW_AT_external    : 1
    <afc>   DW_AT_location    : 9 byte block: 3 f0 30 0 0 0 0 0 0 	(DW_OP_addr: 30f0)
 <1><b06>: Abbrev Number: 35 (DW_TAG_variable)
    <b07>   DW_AT_name        : (indirect string, offset: 0x3f3): ada_main__u00044
    <b0b>   DW_AT_decl_file   : 5
    <b0c>   DW_AT_decl_line   : 126
    <b0d>   DW_AT_decl_column : 4
    <b0e>   DW_AT_linkage_name: (indirect string, offset: 0xdae): ada__exceptions__tracebackB
    <b12>   DW_AT_type        : <0x79>
    <b16>   DW_AT_external    : 1
    <b16>   DW_AT_location    : 9 byte block: 3 f4 30 0 0 0 0 0 0 	(DW_OP_addr: 30f4)
 <1><b20>: Abbrev Number: 35 (DW_TAG_variable)
    <b21>   DW_AT_name        : (indirect string, offset: 0x404): ada_main__u00045
    <b25>   DW_AT_decl_file   : 5
    <b26>   DW_AT_decl_line   : 128
    <b27>   DW_AT_decl_column : 4
    <b28>   DW_AT_linkage_name: (indirect string, offset: 0xe89): ada__exceptions__tracebackS
    <b2c>   DW_AT_type        : <0x79>
    <b30>   DW_AT_external    : 1
    <b30>   DW_AT_location    : 9 byte block: 3 f8 30 0 0 0 0 0 0 	(DW_OP_addr: 30f8)
 <1><b3a>: Abbrev Number: 35 (DW_TAG_variable)
    <b3b>   DW_AT_name        : (indirect string, offset: 0x415): ada_main__u00046
    <b3f>   DW_AT_decl_file   : 5
    <b40>   DW_AT_decl_line   : 130
    <b41>   DW_AT_decl_column : 4
    <b42>   DW_AT_linkage_name: (indirect string, offset: 0x142): interfacesS
    <b46>   DW_AT_type        : <0x79>
    <b4a>   DW_AT_external    : 1
    <b4a>   DW_AT_location    : 9 byte block: 3 fc 30 0 0 0 0 0 0 	(DW_OP_addr: 30fc)
 <1><b54>: Abbrev Number: 35 (DW_TAG_variable)
    <b55>   DW_AT_name        : (indirect string, offset: 0x426): ada_main__u00047
    <b59>   DW_AT_decl_file   : 5
    <b5a>   DW_AT_decl_line   : 132
    <b5b>   DW_AT_decl_column : 4
    <b5c>   DW_AT_linkage_name: (indirect string, offset: 0x19f4): interfaces__cB
    <b60>   DW_AT_type        : <0x79>
    <b64>   DW_AT_external    : 1
    <b64>   DW_AT_location    : 9 byte block: 3 0 31 0 0 0 0 0 0 	(DW_OP_addr: 3100)
 <1><b6e>: Abbrev Number: 35 (DW_TAG_variable)
    <b6f>   DW_AT_name        : (indirect string, offset: 0x1140): ada_main__u00048
    <b73>   DW_AT_decl_file   : 5
    <b74>   DW_AT_decl_line   : 134
    <b75>   DW_AT_decl_column : 4
    <b76>   DW_AT_linkage_name: (indirect string, offset: 0x1a6a): interfaces__cS
    <b7a>   DW_AT_type        : <0x79>
    <b7e>   DW_AT_external    : 1
    <b7e>   DW_AT_location    : 9 byte block: 3 4 31 0 0 0 0 0 0 	(DW_OP_addr: 3104)
 <1><b88>: Abbrev Number: 35 (DW_TAG_variable)
    <b89>   DW_AT_name        : (indirect string, offset: 0x469): ada_main__u00049
    <b8d>   DW_AT_decl_file   : 5
    <b8e>   DW_AT_decl_line   : 136
    <b8f>   DW_AT_decl_column : 4
    <b90>   DW_AT_linkage_name: (indirect string, offset: 0x1695): system__bounded_stringsB
    <b94>   DW_AT_type        : <0x79>
    <b98>   DW_AT_external    : 1
    <b98>   DW_AT_location    : 9 byte block: 3 8 31 0 0 0 0 0 0 	(DW_OP_addr: 3108)
 <1><ba2>: Abbrev Number: 35 (DW_TAG_variable)
    <ba3>   DW_AT_name        : (indirect string, offset: 0x137e): ada_main__u00050
    <ba7>   DW_AT_decl_file   : 5
    <ba8>   DW_AT_decl_line   : 138
    <ba9>   DW_AT_decl_column : 4
    <baa>   DW_AT_linkage_name: (indirect string, offset: 0x1717): system__bounded_stringsS
    <bae>   DW_AT_type        : <0x79>
    <bb2>   DW_AT_external    : 1
    <bb2>   DW_AT_location    : 9 byte block: 3 c 31 0 0 0 0 0 0 	(DW_OP_addr: 310c)
 <1><bbc>: Abbrev Number: 35 (DW_TAG_variable)
    <bbd>   DW_AT_name        : (indirect string, offset: 0x56b): ada_main__u00051
    <bc1>   DW_AT_decl_file   : 5
    <bc2>   DW_AT_decl_line   : 140
    <bc3>   DW_AT_decl_column : 4
    <bc4>   DW_AT_linkage_name: (indirect string, offset: 0x1299): system__crtlS
    <bc8>   DW_AT_type        : <0x79>
    <bcc>   DW_AT_external    : 1
    <bcc>   DW_AT_location    : 9 byte block: 3 10 31 0 0 0 0 0 0 	(DW_OP_addr: 3110)
 <1><bd6>: Abbrev Number: 35 (DW_TAG_variable)
    <bd7>   DW_AT_name        : (indirect string, offset: 0x57c): ada_main__u00052
    <bdb>   DW_AT_decl_file   : 5
    <bdc>   DW_AT_decl_line   : 142
    <bdd>   DW_AT_decl_column : 4
    <bde>   DW_AT_linkage_name: (indirect string, offset: 0x790): system__dwarf_linesB
    <be2>   DW_AT_type        : <0x79>
    <be6>   DW_AT_external    : 1
    <be6>   DW_AT_location    : 9 byte block: 3 14 31 0 0 0 0 0 0 	(DW_OP_addr: 3114)
 <1><bf0>: Abbrev Number: 35 (DW_TAG_variable)
    <bf1>   DW_AT_name        : (indirect string, offset: 0x58d): ada_main__u00053
    <bf5>   DW_AT_decl_file   : 5
    <bf6>   DW_AT_decl_line   : 144
    <bf7>   DW_AT_decl_column : 4
    <bf8>   DW_AT_linkage_name: (indirect string, offset: 0x1c6d): system__dwarf_linesS
    <bfc>   DW_AT_type        : <0x79>
    <c00>   DW_AT_external    : 1
    <c00>   DW_AT_location    : 9 byte block: 3 18 31 0 0 0 0 0 0 	(DW_OP_addr: 3118)
 <1><c0a>: Abbrev Number: 35 (DW_TAG_variable)
    <c0b>   DW_AT_name        : (indirect string, offset: 0x59e): ada_main__u00054
    <c0f>   DW_AT_decl_file   : 5
    <c10>   DW_AT_decl_line   : 146
    <c11>   DW_AT_decl_column : 4
    <c12>   DW_AT_linkage_name: (indirect string, offset: 0xd84): ada__charactersS
    <c16>   DW_AT_type        : <0x79>
    <c1a>   DW_AT_external    : 1
    <c1a>   DW_AT_location    : 9 byte block: 3 1c 31 0 0 0 0 0 0 	(DW_OP_addr: 311c)
 <1><c24>: Abbrev Number: 35 (DW_TAG_variable)
    <c25>   DW_AT_name        : (indirect string, offset: 0x5af): ada_main__u00055
    <c29>   DW_AT_decl_file   : 5
    <c2a>   DW_AT_decl_line   : 148
    <c2b>   DW_AT_decl_column : 4
    <c2c>   DW_AT_linkage_name: (indirect string, offset: 0x2d6): ada__characters__handlingB
    <c30>   DW_AT_type        : <0x79>
    <c34>   DW_AT_external    : 1
    <c34>   DW_AT_location    : 9 byte block: 3 20 31 0 0 0 0 0 0 	(DW_OP_addr: 3120)
 <1><c3e>: Abbrev Number: 35 (DW_TAG_variable)
    <c3f>   DW_AT_name        : (indirect string, offset: 0x5c0): ada_main__u00056
    <c43>   DW_AT_decl_file   : 5
    <c44>   DW_AT_decl_line   : 150
    <c45>   DW_AT_decl_column : 4
    <c46>   DW_AT_linkage_name: (indirect string, offset: 0x350): ada__characters__handlingS
    <c4a>   DW_AT_type        : <0x79>
    <c4e>   DW_AT_external    : 1
    <c4e>   DW_AT_location    : 9 byte block: 3 24 31 0 0 0 0 0 0 	(DW_OP_addr: 3124)
 <1><c58>: Abbrev Number: 35 (DW_TAG_variable)
    <c59>   DW_AT_name        : (indirect string, offset: 0x5d1): ada_main__u00057
    <c5d>   DW_AT_decl_file   : 5
    <c5e>   DW_AT_decl_line   : 152
    <c5f>   DW_AT_decl_column : 4
    <c60>   DW_AT_linkage_name: (indirect string, offset: 0x45): ada__characters__latin_1S
    <c64>   DW_AT_type        : <0x79>
    <c68>   DW_AT_external    : 1
    <c68>   DW_AT_location    : 9 byte block: 3 28 31 0 0 0 0 0 0 	(DW_OP_addr: 3128)
 <1><c72>: Abbrev Number: 35 (DW_TAG_variable)
    <c73>   DW_AT_name        : (indirect string, offset: 0x13de): ada_main__u00058
    <c77>   DW_AT_decl_file   : 5
    <c78>   DW_AT_decl_line   : 154
    <c79>   DW_AT_decl_column : 4
    <c7a>   DW_AT_linkage_name: (indirect string, offset: 0x503): ada__stringsS
    <c7e>   DW_AT_type        : <0x79>
    <c82>   DW_AT_external    : 1
    <c82>   DW_AT_location    : 9 byte block: 3 2c 31 0 0 0 0 0 0 	(DW_OP_addr: 312c)
 <1><c8c>: Abbrev Number: 35 (DW_TAG_variable)
    <c8d>   DW_AT_name        : (indirect string, offset: 0x618): ada_main__u00059
    <c91>   DW_AT_decl_file   : 5
    <c92>   DW_AT_decl_line   : 156
    <c93>   DW_AT_decl_column : 4
    <c94>   DW_AT_linkage_name: (indirect string, offset: 0x933): ada__strings__mapsB
    <c98>   DW_AT_type        : <0x79>
    <c9c>   DW_AT_external    : 1
    <c9c>   DW_AT_location    : 9 byte block: 3 30 31 0 0 0 0 0 0 	(DW_OP_addr: 3130)
 <1><ca6>: Abbrev Number: 35 (DW_TAG_variable)
    <ca7>   DW_AT_name        : (indirect string, offset: 0xb22): ada_main__u00060
    <cab>   DW_AT_decl_file   : 5
    <cac>   DW_AT_decl_line   : 158
    <cad>   DW_AT_decl_column : 4
    <cae>   DW_AT_linkage_name: (indirect string, offset: 0x1779): ada__strings__mapsS
    <cb2>   DW_AT_type        : <0x79>
    <cb6>   DW_AT_external    : 1
    <cb6>   DW_AT_location    : 9 byte block: 3 34 31 0 0 0 0 0 0 	(DW_OP_addr: 3134)
 <1><cc0>: Abbrev Number: 35 (DW_TAG_variable)
    <cc1>   DW_AT_name        : (indirect string, offset: 0x7be): ada_main__u00061
    <cc5>   DW_AT_decl_file   : 5
    <cc6>   DW_AT_decl_line   : 160
    <cc7>   DW_AT_decl_column : 4
    <cc8>   DW_AT_linkage_name: (indirect string, offset: 0x8da): system__bit_opsB
    <ccc>   DW_AT_type        : <0x79>
    <cd0>   DW_AT_external    : 1
    <cd0>   DW_AT_location    : 9 byte block: 3 38 31 0 0 0 0 0 0 	(DW_OP_addr: 3138)
 <1><cda>: Abbrev Number: 35 (DW_TAG_variable)
    <cdb>   DW_AT_name        : (indirect string, offset: 0x7cf): ada_main__u00062
    <cdf>   DW_AT_decl_file   : 5
    <ce0>   DW_AT_decl_line   : 162
    <ce1>   DW_AT_decl_column : 4
    <ce2>   DW_AT_linkage_name: (indirect string, offset: 0x99c): system__bit_opsS
    <ce6>   DW_AT_type        : <0x79>
    <cea>   DW_AT_external    : 1
    <cea>   DW_AT_location    : 9 byte block: 3 3c 31 0 0 0 0 0 0 	(DW_OP_addr: 313c)
 <1><cf4>: Abbrev Number: 35 (DW_TAG_variable)
    <cf5>   DW_AT_name        : (indirect string, offset: 0x7e0): ada_main__u00063
    <cf9>   DW_AT_decl_file   : 5
    <cfa>   DW_AT_decl_line   : 164
    <cfb>   DW_AT_decl_column : 4
    <cfc>   DW_AT_linkage_name: (indirect string, offset: 0xa4f): system__unsigned_typesS
    <d00>   DW_AT_type        : <0x79>
    <d04>   DW_AT_external    : 1
    <d04>   DW_AT_location    : 9 byte block: 3 40 31 0 0 0 0 0 0 	(DW_OP_addr: 3140)
 <1><d0e>: Abbrev Number: 35 (DW_TAG_variable)
    <d0f>   DW_AT_name        : (indirect string, offset: 0x7f1): ada_main__u00064
    <d13>   DW_AT_decl_file   : 5
    <d14>   DW_AT_decl_line   : 166
    <d15>   DW_AT_decl_column : 4
    <d16>   DW_AT_linkage_name: (indirect string, offset: 0x1d51): ada__strings__maps__constantsS
    <d1a>   DW_AT_type        : <0x79>
    <d1e>   DW_AT_external    : 1
    <d1e>   DW_AT_location    : 9 byte block: 3 44 31 0 0 0 0 0 0 	(DW_OP_addr: 3144)
 <1><d28>: Abbrev Number: 35 (DW_TAG_variable)
    <d29>   DW_AT_name        : (indirect string, offset: 0x802): ada_main__u00065
    <d2d>   DW_AT_decl_file   : 5
    <d2e>   DW_AT_decl_line   : 168
    <d2f>   DW_AT_decl_column : 4
    <d30>   DW_AT_linkage_name: (indirect string, offset: 0x10de): system__address_imageB
    <d34>   DW_AT_type        : <0x79>
    <d38>   DW_AT_external    : 1
    <d38>   DW_AT_location    : 9 byte block: 3 48 31 0 0 0 0 0 0 	(DW_OP_addr: 3148)
 <1><d42>: Abbrev Number: 35 (DW_TAG_variable)
    <d43>   DW_AT_name        : (indirect string, offset: 0x813): ada_main__u00066
    <d47>   DW_AT_decl_file   : 5
    <d48>   DW_AT_decl_line   : 170
    <d49>   DW_AT_decl_column : 4
    <d4a>   DW_AT_linkage_name: (indirect string, offset: 0x1151): system__address_imageS
    <d4e>   DW_AT_type        : <0x79>
    <d52>   DW_AT_external    : 1
    <d52>   DW_AT_location    : 9 byte block: 3 4c 31 0 0 0 0 0 0 	(DW_OP_addr: 314c)
 <1><d5c>: Abbrev Number: 35 (DW_TAG_variable)
    <d5d>   DW_AT_name        : (indirect string, offset: 0x824): ada_main__u00067
    <d61>   DW_AT_decl_file   : 5
    <d62>   DW_AT_decl_line   : 172
    <d63>   DW_AT_decl_column : 4
    <d64>   DW_AT_linkage_name: (indirect string, offset: 0x104a): system__img_unsB
    <d68>   DW_AT_type        : <0x79>
    <d6c>   DW_AT_external    : 1
    <d6c>   DW_AT_location    : 9 byte block: 3 50 31 0 0 0 0 0 0 	(DW_OP_addr: 3150)
 <1><d76>: Abbrev Number: 35 (DW_TAG_variable)
    <d77>   DW_AT_name        : (indirect string, offset: 0x835): ada_main__u00068
    <d7b>   DW_AT_decl_file   : 5
    <d7c>   DW_AT_decl_line   : 174
    <d7d>   DW_AT_decl_column : 4
    <d7e>   DW_AT_linkage_name: (indirect string, offset: 0x77f): system__img_unsS
    <d82>   DW_AT_type        : <0x79>
    <d86>   DW_AT_external    : 1
    <d86>   DW_AT_location    : 9 byte block: 3 54 31 0 0 0 0 0 0 	(DW_OP_addr: 3154)
 <1><d90>: Abbrev Number: 35 (DW_TAG_variable)
    <d91>   DW_AT_name        : (indirect string, offset: 0x846): ada_main__u00069
    <d95>   DW_AT_decl_file   : 5
    <d96>   DW_AT_decl_line   : 176
    <d97>   DW_AT_decl_column : 4
    <d98>   DW_AT_linkage_name: (indirect string, offset: 0x132f): system__ioB
    <d9c>   DW_AT_type        : <0x79>
    <da0>   DW_AT_external    : 1
    <da0>   DW_AT_location    : 9 byte block: 3 58 31 0 0 0 0 0 0 	(DW_OP_addr: 3158)
 <1><daa>: Abbrev Number: 35 (DW_TAG_variable)
    <dab>   DW_AT_name        : (indirect string, offset: 0x947): ada_main__u00070
    <daf>   DW_AT_decl_file   : 5
    <db0>   DW_AT_decl_line   : 178
    <db1>   DW_AT_decl_column : 4
    <db2>   DW_AT_linkage_name: (indirect string, offset: 0x138f): system__ioS
    <db6>   DW_AT_type        : <0x79>
    <dba>   DW_AT_external    : 1
    <dba>   DW_AT_location    : 9 byte block: 3 5c 31 0 0 0 0 0 0 	(DW_OP_addr: 315c)
 <1><dc4>: Abbrev Number: 35 (DW_TAG_variable)
    <dc5>   DW_AT_name        : (indirect string, offset: 0x958): ada_main__u00071
    <dc9>   DW_AT_decl_file   : 5
    <dca>   DW_AT_decl_line   : 180
    <dcb>   DW_AT_decl_column : 4
    <dcc>   DW_AT_linkage_name: (indirect string, offset: 0x1d43): system__mmapB
    <dd0>   DW_AT_type        : <0x79>
    <dd4>   DW_AT_external    : 1
    <dd4>   DW_AT_location    : 9 byte block: 3 60 31 0 0 0 0 0 0 	(DW_OP_addr: 3160)
 <1><dde>: Abbrev Number: 35 (DW_TAG_variable)
    <ddf>   DW_AT_name        : (indirect string, offset: 0x969): ada_main__u00072
    <de3>   DW_AT_decl_file   : 5
    <de4>   DW_AT_decl_line   : 182
    <de5>   DW_AT_decl_column : 4
    <de6>   DW_AT_linkage_name: (indirect string, offset: 0x1014): system__mmapS
    <dea>   DW_AT_type        : <0x79>
    <dee>   DW_AT_external    : 1
    <dee>   DW_AT_location    : 9 byte block: 3 64 31 0 0 0 0 0 0 	(DW_OP_addr: 3164)
 <1><df8>: Abbrev Number: 35 (DW_TAG_variable)
    <df9>   DW_AT_name        : (indirect string, offset: 0x97a): ada_main__u00073
    <dfd>   DW_AT_decl_file   : 5
    <dfe>   DW_AT_decl_line   : 184
    <dff>   DW_AT_decl_column : 4
    <e00>   DW_AT_linkage_name: (indirect string, offset: 0x1112): ada__io_exceptionsS
    <e04>   DW_AT_type        : <0x79>
    <e08>   DW_AT_external    : 1
    <e08>   DW_AT_location    : 9 byte block: 3 68 31 0 0 0 0 0 0 	(DW_OP_addr: 3168)
 <1><e12>: Abbrev Number: 35 (DW_TAG_variable)
    <e13>   DW_AT_name        : (indirect string, offset: 0x98b): ada_main__u00074
    <e17>   DW_AT_decl_file   : 5
    <e18>   DW_AT_decl_line   : 186
    <e19>   DW_AT_decl_column : 4
    <e1a>   DW_AT_linkage_name: (indirect string, offset: 0x14aa): system__mmap__os_interfaceB
    <e1e>   DW_AT_type        : <0x79>
    <e22>   DW_AT_external    : 1
    <e22>   DW_AT_location    : 9 byte block: 3 6c 31 0 0 0 0 0 0 	(DW_OP_addr: 316c)
 <1><e2c>: Abbrev Number: 35 (DW_TAG_variable)
    <e2d>   DW_AT_name        : (indirect string, offset: 0x1ca6): ada_main__u00075
    <e31>   DW_AT_decl_file   : 5
    <e32>   DW_AT_decl_line   : 188
    <e33>   DW_AT_decl_column : 4
    <e34>   DW_AT_linkage_name: (indirect string, offset: 0x1d90): system__mmap__os_interfaceS
    <e38>   DW_AT_type        : <0x79>
    <e3c>   DW_AT_external    : 1
    <e3c>   DW_AT_location    : 9 byte block: 3 70 31 0 0 0 0 0 0 	(DW_OP_addr: 3170)
 <1><e46>: Abbrev Number: 35 (DW_TAG_variable)
    <e47>   DW_AT_name        : (indirect string, offset: 0x9ad): ada_main__u00076
    <e4b>   DW_AT_decl_file   : 5
    <e4c>   DW_AT_decl_line   : 190
    <e4d>   DW_AT_decl_column : 4
    <e4e>   DW_AT_linkage_name: (indirect string, offset: 0x232): system__mmap__unixS
    <e52>   DW_AT_type        : <0x79>
    <e56>   DW_AT_external    : 1
    <e56>   DW_AT_location    : 9 byte block: 3 74 31 0 0 0 0 0 0 	(DW_OP_addr: 3174)
 <1><e60>: Abbrev Number: 35 (DW_TAG_variable)
    <e61>   DW_AT_name        : (indirect string, offset: 0x679): ada_main__u00077
    <e65>   DW_AT_decl_file   : 5
    <e66>   DW_AT_decl_line   : 192
    <e67>   DW_AT_decl_column : 4
    <e68>   DW_AT_linkage_name: (indirect string, offset: 0x1130): system__os_libB
    <e6c>   DW_AT_type        : <0x79>
    <e70>   DW_AT_external    : 1
    <e70>   DW_AT_location    : 9 byte block: 3 78 31 0 0 0 0 0 0 	(DW_OP_addr: 3178)
 <1><e7a>: Abbrev Number: 35 (DW_TAG_variable)
    <e7b>   DW_AT_name        : (indirect string, offset: 0x1cd7): ada_main__u00078
    <e7f>   DW_AT_decl_file   : 5
    <e80>   DW_AT_decl_line   : 194
    <e81>   DW_AT_decl_column : 4
    <e82>   DW_AT_linkage_name: (indirect string, offset: 0x11a9): system__os_libS
    <e86>   DW_AT_type        : <0x79>
    <e8a>   DW_AT_external    : 1
    <e8a>   DW_AT_location    : 9 byte block: 3 7c 31 0 0 0 0 0 0 	(DW_OP_addr: 317c)
 <1><e94>: Abbrev Number: 35 (DW_TAG_variable)
    <e95>   DW_AT_name        : (indirect string, offset: 0xa67): ada_main__u00079
    <e99>   DW_AT_decl_file   : 5
    <e9a>   DW_AT_decl_line   : 196
    <e9b>   DW_AT_decl_column : 4
    <e9c>   DW_AT_linkage_name: (indirect string, offset: 0xdc): system__case_utilB
    <ea0>   DW_AT_type        : <0x79>
    <ea4>   DW_AT_external    : 1
    <ea4>   DW_AT_location    : 9 byte block: 3 80 31 0 0 0 0 0 0 	(DW_OP_addr: 3180)
 <1><eae>: Abbrev Number: 35 (DW_TAG_variable)
    <eaf>   DW_AT_name        : (indirect string, offset: 0xb77): ada_main__u00080
    <eb3>   DW_AT_decl_file   : 5
    <eb4>   DW_AT_decl_line   : 198
    <eb5>   DW_AT_decl_column : 4
    <eb6>   DW_AT_linkage_name: (indirect string, offset: 0x15f): system__case_utilS
    <eba>   DW_AT_type        : <0x79>
    <ebe>   DW_AT_external    : 1
    <ebe>   DW_AT_location    : 9 byte block: 3 84 31 0 0 0 0 0 0 	(DW_OP_addr: 3184)
 <1><ec8>: Abbrev Number: 35 (DW_TAG_variable)
    <ec9>   DW_AT_name        : (indirect string, offset: 0xb88): ada_main__u00081
    <ecd>   DW_AT_decl_file   : 5
    <ece>   DW_AT_decl_line   : 200
    <ecf>   DW_AT_decl_column : 4
    <ed0>   DW_AT_linkage_name: (indirect string, offset: 0x162c): system__stringsB
    <ed4>   DW_AT_type        : <0x79>
    <ed8>   DW_AT_external    : 1
    <ed8>   DW_AT_location    : 9 byte block: 3 88 31 0 0 0 0 0 0 	(DW_OP_addr: 3188)
 <1><ee2>: Abbrev Number: 35 (DW_TAG_variable)
    <ee3>   DW_AT_name        : (indirect string, offset: 0xb99): ada_main__u00082
    <ee7>   DW_AT_decl_file   : 5
    <ee8>   DW_AT_decl_line   : 202
    <ee9>   DW_AT_decl_column : 4
    <eea>   DW_AT_linkage_name: (indirect string, offset: 0x8c9): system__stringsS
    <eee>   DW_AT_type        : <0x79>
    <ef2>   DW_AT_external    : 1
    <ef2>   DW_AT_location    : 9 byte block: 3 8c 31 0 0 0 0 0 0 	(DW_OP_addr: 318c)
 <1><efc>: Abbrev Number: 35 (DW_TAG_variable)
    <efd>   DW_AT_name        : (indirect string, offset: 0xbaa): ada_main__u00083
    <f01>   DW_AT_decl_file   : 5
    <f02>   DW_AT_decl_line   : 204
    <f03>   DW_AT_decl_column : 4
    <f04>   DW_AT_linkage_name: (indirect string, offset: 0xc6e): system__object_readerB
    <f08>   DW_AT_type        : <0x79>
    <f0c>   DW_AT_external    : 1
    <f0c>   DW_AT_location    : 9 byte block: 3 90 31 0 0 0 0 0 0 	(DW_OP_addr: 3190)
 <1><f16>: Abbrev Number: 35 (DW_TAG_variable)
    <f17>   DW_AT_name        : (indirect string, offset: 0xbbb): ada_main__u00084
    <f1b>   DW_AT_decl_file   : 5
    <f1c>   DW_AT_decl_line   : 206
    <f1d>   DW_AT_decl_column : 4
    <f1e>   DW_AT_linkage_name: (indirect string, offset: 0xd03): system__object_readerS
    <f22>   DW_AT_type        : <0x79>
    <f26>   DW_AT_external    : 1
    <f26>   DW_AT_location    : 9 byte block: 3 94 31 0 0 0 0 0 0 	(DW_OP_addr: 3194)
 <1><f30>: Abbrev Number: 35 (DW_TAG_variable)
    <f31>   DW_AT_name        : (indirect string, offset: 0xbcc): ada_main__u00085
    <f35>   DW_AT_decl_file   : 5
    <f36>   DW_AT_decl_line   : 208
    <f37>   DW_AT_decl_column : 4
    <f38>   DW_AT_linkage_name: (indirect string, offset: 0x14e1): system__val_lliB
    <f3c>   DW_AT_type        : <0x79>
    <f40>   DW_AT_external    : 1
    <f40>   DW_AT_location    : 9 byte block: 3 98 31 0 0 0 0 0 0 	(DW_OP_addr: 3198)
 <1><f4a>: Abbrev Number: 35 (DW_TAG_variable)
    <f4b>   DW_AT_name        : (indirect string, offset: 0xbdd): ada_main__u00086
    <f4f>   DW_AT_decl_file   : 5
    <f50>   DW_AT_decl_line   : 210
    <f51>   DW_AT_decl_column : 4
    <f52>   DW_AT_linkage_name: (indirect string, offset: 0x15a2): system__val_lliS
    <f56>   DW_AT_type        : <0x79>
    <f5a>   DW_AT_external    : 1
    <f5a>   DW_AT_location    : 9 byte block: 3 9c 31 0 0 0 0 0 0 	(DW_OP_addr: 319c)
 <1><f64>: Abbrev Number: 35 (DW_TAG_variable)
    <f65>   DW_AT_name        : (indirect string, offset: 0x546): ada_main__u00087
    <f69>   DW_AT_decl_file   : 5
    <f6a>   DW_AT_decl_line   : 212
    <f6b>   DW_AT_decl_column : 4
    <f6c>   DW_AT_linkage_name: (indirect string, offset: 0x37e): system__val_lluB
    <f70>   DW_AT_type        : <0x79>
    <f74>   DW_AT_external    : 1
    <f74>   DW_AT_location    : 9 byte block: 3 a0 31 0 0 0 0 0 0 	(DW_OP_addr: 31a0)
 <1><f7e>: Abbrev Number: 35 (DW_TAG_variable)
    <f7f>   DW_AT_name        : (indirect string, offset: 0xc09): ada_main__u00088
    <f83>   DW_AT_decl_file   : 5
    <f84>   DW_AT_decl_line   : 214
    <f85>   DW_AT_decl_column : 4
    <f86>   DW_AT_linkage_name: (indirect string, offset: 0x153a): system__val_lluS
    <f8a>   DW_AT_type        : <0x79>
    <f8e>   DW_AT_external    : 1
    <f8e>   DW_AT_location    : 9 byte block: 3 a4 31 0 0 0 0 0 0 	(DW_OP_addr: 31a4)
 <1><f98>: Abbrev Number: 35 (DW_TAG_variable)
    <f99>   DW_AT_name        : (indirect string, offset: 0xc1a): ada_main__u00089
    <f9d>   DW_AT_decl_file   : 5
    <f9e>   DW_AT_decl_line   : 216
    <f9f>   DW_AT_decl_column : 4
    <fa0>   DW_AT_linkage_name: (indirect string, offset: 0x133b): system__val_utilB
    <fa4>   DW_AT_type        : <0x79>
    <fa8>   DW_AT_external    : 1
    <fa8>   DW_AT_location    : 9 byte block: 3 a8 31 0 0 0 0 0 0 	(DW_OP_addr: 31a8)
 <1><fb2>: Abbrev Number: 35 (DW_TAG_variable)
    <fb3>   DW_AT_name        : (indirect string, offset: 0x629): ada_main__u00090
    <fb7>   DW_AT_decl_file   : 5
    <fb8>   DW_AT_decl_line   : 218
    <fb9>   DW_AT_decl_column : 4
    <fba>   DW_AT_linkage_name: (indirect string, offset: 0x15c2): system__val_utilS
    <fbe>   DW_AT_type        : <0x79>
    <fc2>   DW_AT_external    : 1
    <fc2>   DW_AT_location    : 9 byte block: 3 ac 31 0 0 0 0 0 0 	(DW_OP_addr: 31ac)
 <1><fcc>: Abbrev Number: 35 (DW_TAG_variable)
    <fcd>   DW_AT_name        : (indirect string, offset: 0xdca): ada_main__u00091
    <fd1>   DW_AT_decl_file   : 5
    <fd2>   DW_AT_decl_line   : 220
    <fd3>   DW_AT_decl_column : 4
    <fd4>   DW_AT_linkage_name: (indirect string, offset: 0xd59): system__exception_tracesB
    <fd8>   DW_AT_type        : <0x79>
    <fdc>   DW_AT_external    : 1
    <fdc>   DW_AT_location    : 9 byte block: 3 b0 31 0 0 0 0 0 0 	(DW_OP_addr: 31b0)
 <1><fe6>: Abbrev Number: 35 (DW_TAG_variable)
    <fe7>   DW_AT_name        : (indirect string, offset: 0xddb): ada_main__u00092
    <feb>   DW_AT_decl_file   : 5
    <fec>   DW_AT_decl_line   : 222
    <fed>   DW_AT_decl_column : 4
    <fee>   DW_AT_linkage_name: (indirect string, offset: 0xe41): system__exception_tracesS
    <ff2>   DW_AT_type        : <0x79>
    <ff6>   DW_AT_external    : 1
    <ff6>   DW_AT_location    : 9 byte block: 3 b4 31 0 0 0 0 0 0 	(DW_OP_addr: 31b4)
 <1><1000>: Abbrev Number: 35 (DW_TAG_variable)
    <1001>   DW_AT_name        : (indirect string, offset: 0xdec): ada_main__u00093
    <1005>   DW_AT_decl_file   : 5
    <1006>   DW_AT_decl_line   : 224
    <1007>   DW_AT_decl_column : 4
    <1008>   DW_AT_linkage_name: (indirect string, offset: 0x131): system__wch_conB
    <100c>   DW_AT_type        : <0x79>
    <1010>   DW_AT_external    : 1
    <1010>   DW_AT_location    : 9 byte block: 3 b8 31 0 0 0 0 0 0 	(DW_OP_addr: 31b8)
 <1><101a>: Abbrev Number: 35 (DW_TAG_variable)
    <101b>   DW_AT_name        : (indirect string, offset: 0xdfd): ada_main__u00094
    <101f>   DW_AT_decl_file   : 5
    <1020>   DW_AT_decl_line   : 226
    <1021>   DW_AT_decl_column : 4
    <1022>   DW_AT_linkage_name: (indirect string, offset: 0x246): system__wch_conS
    <1026>   DW_AT_type        : <0x79>
    <102a>   DW_AT_external    : 1
    <102a>   DW_AT_location    : 9 byte block: 3 bc 31 0 0 0 0 0 0 	(DW_OP_addr: 31bc)
 <1><1034>: Abbrev Number: 35 (DW_TAG_variable)
    <1035>   DW_AT_name        : (indirect string, offset: 0xe0e): ada_main__u00095
    <1039>   DW_AT_decl_file   : 5
    <103a>   DW_AT_decl_line   : 228
    <103b>   DW_AT_decl_column : 4
    <103c>   DW_AT_linkage_name: (indirect string, offset: 0xfe2): system__wch_stwB
    <1040>   DW_AT_type        : <0x79>
    <1044>   DW_AT_external    : 1
    <1044>   DW_AT_location    : 9 byte block: 3 c0 31 0 0 0 0 0 0 	(DW_OP_addr: 31c0)
 <1><104e>: Abbrev Number: 35 (DW_TAG_variable)
    <104f>   DW_AT_name        : (indirect string, offset: 0xe1f): ada_main__u00096
    <1053>   DW_AT_decl_file   : 5
    <1054>   DW_AT_decl_line   : 230
    <1055>   DW_AT_decl_column : 4
    <1056>   DW_AT_linkage_name: (indirect string, offset: 0x1003): system__wch_stwS
    <105a>   DW_AT_type        : <0x79>
    <105e>   DW_AT_external    : 1
    <105e>   DW_AT_location    : 9 byte block: 3 c4 31 0 0 0 0 0 0 	(DW_OP_addr: 31c4)
 <1><1068>: Abbrev Number: 35 (DW_TAG_variable)
    <1069>   DW_AT_name        : (indirect string, offset: 0xe30): ada_main__u00097
    <106d>   DW_AT_decl_file   : 5
    <106e>   DW_AT_decl_line   : 232
    <106f>   DW_AT_decl_column : 4
    <1070>   DW_AT_linkage_name: (indirect string, offset: 0x17c9): system__wch_cnvB
    <1074>   DW_AT_type        : <0x79>
    <1078>   DW_AT_external    : 1
    <1078>   DW_AT_location    : 9 byte block: 3 c8 31 0 0 0 0 0 0 	(DW_OP_addr: 31c8)
 <1><1082>: Abbrev Number: 35 (DW_TAG_variable)
    <1083>   DW_AT_name        : (indirect string, offset: 0x6a3): ada_main__u00098
    <1087>   DW_AT_decl_file   : 5
    <1088>   DW_AT_decl_line   : 234
    <1089>   DW_AT_decl_column : 4
    <108a>   DW_AT_linkage_name: (indirect string, offset: 0x185b): system__wch_cnvS
    <108e>   DW_AT_type        : <0x79>
    <1092>   DW_AT_external    : 1
    <1092>   DW_AT_location    : 9 byte block: 3 cc 31 0 0 0 0 0 0 	(DW_OP_addr: 31cc)
 <1><109c>: Abbrev Number: 35 (DW_TAG_variable)
    <109d>   DW_AT_name        : (indirect string, offset: 0xe5b): ada_main__u00099
    <10a1>   DW_AT_decl_file   : 5
    <10a2>   DW_AT_decl_line   : 236
    <10a3>   DW_AT_decl_column : 4
    <10a4>   DW_AT_linkage_name: (indirect string, offset: 0x1d): system__wch_jisB
    <10a8>   DW_AT_type        : <0x79>
    <10ac>   DW_AT_external    : 1
    <10ac>   DW_AT_location    : 9 byte block: 3 d0 31 0 0 0 0 0 0 	(DW_OP_addr: 31d0)
 <1><10b6>: Abbrev Number: 35 (DW_TAG_variable)
    <10b7>   DW_AT_name        : (indirect string, offset: 0x17b8): ada_main__u00100
    <10bb>   DW_AT_decl_file   : 5
    <10bc>   DW_AT_decl_line   : 238
    <10bd>   DW_AT_decl_column : 4
    <10be>   DW_AT_linkage_name: (indirect string, offset: 0x1458): system__wch_jisS
    <10c2>   DW_AT_type        : <0x79>
    <10c6>   DW_AT_external    : 1
    <10c6>   DW_AT_location    : 9 byte block: 3 d4 31 0 0 0 0 0 0 	(DW_OP_addr: 31d4)
 <1><10d0>: Abbrev Number: 32 (DW_TAG_variable)
    <10d1>   DW_AT_name        : (indirect string, offset: 0x14f2): ada_main__e078
    <10d5>   DW_AT_decl_file   : 1
    <10d6>   DW_AT_decl_line   : 9
    <10d7>   DW_AT_decl_column : 4
    <10d8>   DW_AT_linkage_name: (indirect string, offset: 0x2c5): system__os_lib_E
    <10dc>   DW_AT_type        : <0x1128>
    <10e0>   DW_AT_external    : 1
    <10e0>   DW_AT_declaration : 1
 <1><10e0>: Abbrev Number: 9 (DW_TAG_base_type)
    <10e1>   DW_AT_byte_size   : 2
    <10e2>   DW_AT_encoding    : 5	(signed)
    <10e3>   DW_AT_name        : (indirect string, offset: 0x1660): short_integer
    <10e7>   DW_AT_artificial  : 1
 <1><10e7>: Abbrev Number: 33 (DW_TAG_volatile_type)
    <10e8>   DW_AT_type        : <0x10e0>
    <10ec>   DW_AT_artificial  : 1
 <1><10ec>: Abbrev Number: 33 (DW_TAG_volatile_type)
    <10ed>   DW_AT_type        : <0x10e0>
    <10f1>   DW_AT_artificial  : 1
 <1><10f1>: Abbrev Number: 33 (DW_TAG_volatile_type)
    <10f2>   DW_AT_type        : <0x10e0>
    <10f6>   DW_AT_artificial  : 1
 <1><10f6>: Abbrev Number: 33 (DW_TAG_volatile_type)
    <10f7>   DW_AT_type        : <0x10e0>
    <10fb>   DW_AT_artificial  : 1
 <1><10fb>: Abbrev Number: 33 (DW_TAG_volatile_type)
    <10fc>   DW_AT_type        : <0x10e0>
    <1100>   DW_AT_artificial  : 1
 <1><1100>: Abbrev Number: 33 (DW_TAG_volatile_type)
    <1101>   DW_AT_type        : <0x10e0>
    <1105>   DW_AT_artificial  : 1
 <1><1105>: Abbrev Number: 33 (DW_TAG_volatile_type)
    <1106>   DW_AT_type        : <0x10e0>
    <110a>   DW_AT_artificial  : 1
 <1><110a>: Abbrev Number: 33 (DW_TAG_volatile_type)
    <110b>   DW_AT_type        : <0x10e0>
    <110f>   DW_AT_artificial  : 1
 <1><110f>: Abbrev Number: 33 (DW_TAG_volatile_type)
    <1110>   DW_AT_type        : <0x10e0>
    <1114>   DW_AT_artificial  : 1
 <1><1114>: Abbrev Number: 33 (DW_TAG_volatile_type)
    <1115>   DW_AT_type        : <0x10e0>
    <1119>   DW_AT_artificial  : 1
 <1><1119>: Abbrev Number: 33 (DW_TAG_volatile_type)
    <111a>   DW_AT_type        : <0x10e0>
    <111e>   DW_AT_artificial  : 1
 <1><111e>: Abbrev Number: 33 (DW_TAG_volatile_type)
    <111f>   DW_AT_type        : <0x10e0>
    <1123>   DW_AT_artificial  : 1
 <1><1123>: Abbrev Number: 33 (DW_TAG_volatile_type)
    <1124>   DW_AT_type        : <0x10e0>
    <1128>   DW_AT_artificial  : 1
 <1><1128>: Abbrev Number: 33 (DW_TAG_volatile_type)
    <1129>   DW_AT_type        : <0x10e0>
    <112d>   DW_AT_artificial  : 1
 <1><112d>: Abbrev Number: 32 (DW_TAG_variable)
    <112e>   DW_AT_name        : (indirect string, offset: 0x163d): ada_main__e016
    <1132>   DW_AT_decl_file   : 1
    <1133>   DW_AT_decl_line   : 10
    <1134>   DW_AT_decl_column : 4
    <1135>   DW_AT_linkage_name: (indirect string, offset: 0xa8f): system__soft_links_E
    <1139>   DW_AT_type        : <0x1123>
    <113d>   DW_AT_external    : 1
    <113d>   DW_AT_declaration : 1
 <1><113d>: Abbrev Number: 32 (DW_TAG_variable)
    <113e>   DW_AT_name        : (indirect string, offset: 0xaf5): ada_main__e028
    <1142>   DW_AT_decl_file   : 1
    <1143>   DW_AT_decl_line   : 11
    <1144>   DW_AT_decl_column : 4
    <1145>   DW_AT_linkage_name: (indirect string, offset: 0x12f8): system__exception_table_E
    <1149>   DW_AT_type        : <0x111e>
    <114d>   DW_AT_external    : 1
    <114d>   DW_AT_declaration : 1
 <1><114d>: Abbrev Number: 32 (DW_TAG_variable)
    <114e>   DW_AT_name        : (indirect string, offset: 0x2e): ada_main__e073
    <1152>   DW_AT_decl_file   : 1
    <1153>   DW_AT_decl_line   : 12
    <1154>   DW_AT_decl_column : 4
    <1155>   DW_AT_linkage_name: (indirect string, offset: 0xad0): ada__io_exceptions_E
    <1159>   DW_AT_type        : <0x1119>
    <115d>   DW_AT_external    : 1
    <115d>   DW_AT_declaration : 1
 <1><115d>: Abbrev Number: 32 (DW_TAG_variable)
    <115e>   DW_AT_name        : (indirect string, offset: 0x15b3): ada_main__e058
    <1162>   DW_AT_decl_file   : 1
    <1163>   DW_AT_decl_line   : 13
    <1164>   DW_AT_decl_column : 4
    <1165>   DW_AT_linkage_name: (indirect string, offset: 0xcb7): ada__strings_E
    <1169>   DW_AT_type        : <0x1114>
    <116d>   DW_AT_external    : 1
    <116d>   DW_AT_declaration : 1
 <1><116d>: Abbrev Number: 32 (DW_TAG_variable)
    <116e>   DW_AT_name        : (indirect string, offset: 0x1cf7): ada_main__e043
    <1172>   DW_AT_decl_file   : 1
    <1173>   DW_AT_decl_line   : 14
    <1174>   DW_AT_decl_column : 4
    <1175>   DW_AT_linkage_name: (indirect string, offset: 0x33e): ada__containers_E
    <1179>   DW_AT_type        : <0x110f>
    <117d>   DW_AT_external    : 1
    <117d>   DW_AT_declaration : 1
 <1><117d>: Abbrev Number: 32 (DW_TAG_variable)
    <117e>   DW_AT_name        : (indirect string, offset: 0x1a79): ada_main__e030
    <1182>   DW_AT_decl_file   : 1
    <1183>   DW_AT_decl_line   : 15
    <1184>   DW_AT_decl_column : 4
    <1185>   DW_AT_linkage_name: (indirect string, offset: 0x117c): system__exceptions_E
    <1189>   DW_AT_type        : <0x110a>
    <118d>   DW_AT_external    : 1
    <118d>   DW_AT_declaration : 1
 <1><118d>: Abbrev Number: 32 (DW_TAG_variable)
    <118e>   DW_AT_name        : (indirect string, offset: 0x17ff): ada_main__e024
    <1192>   DW_AT_decl_file   : 1
    <1193>   DW_AT_decl_line   : 16
    <1194>   DW_AT_decl_column : 4
    <1195>   DW_AT_linkage_name: (indirect string, offset: 0x1088): system__soft_links__initialize_E
    <1199>   DW_AT_type        : <0x1105>
    <119d>   DW_AT_external    : 1
    <119d>   DW_AT_declaration : 1
 <1><119d>: Abbrev Number: 32 (DW_TAG_variable)
    <119e>   DW_AT_name        : (indirect string, offset: 0x2f1): ada_main__e060
    <11a2>   DW_AT_decl_file   : 1
    <11a3>   DW_AT_decl_line   : 17
    <11a4>   DW_AT_decl_column : 4
    <11a5>   DW_AT_linkage_name: (indirect string, offset: 0x11b9): ada__strings__maps_E
    <11a9>   DW_AT_type        : <0x1100>
    <11ad>   DW_AT_external    : 1
    <11ad>   DW_AT_declaration : 1
 <1><11ad>: Abbrev Number: 32 (DW_TAG_variable)
    <11ae>   DW_AT_name        : (indirect string, offset: 0x1a41): ada_main__e064
    <11b2>   DW_AT_decl_file   : 1
    <11b3>   DW_AT_decl_line   : 18
    <11b4>   DW_AT_decl_column : 4
    <11b5>   DW_AT_linkage_name: (indirect string, offset: 0x1d70): ada__strings__maps__constants_E
    <11b9>   DW_AT_type        : <0x10fb>
    <11bd>   DW_AT_external    : 1
    <11bd>   DW_AT_declaration : 1
 <1><11bd>: Abbrev Number: 32 (DW_TAG_variable)
    <11be>   DW_AT_name        : (indirect string, offset: 0x1254): ada_main__e048
    <11c2>   DW_AT_decl_file   : 1
    <11c3>   DW_AT_decl_line   : 19
    <11c4>   DW_AT_decl_column : 4
    <11c5>   DW_AT_linkage_name: (indirect string, offset: 0xae5): interfaces__c_E
    <11c9>   DW_AT_type        : <0x10f6>
    <11cd>   DW_AT_external    : 1
    <11cd>   DW_AT_declaration : 1
 <1><11cd>: Abbrev Number: 32 (DW_TAG_variable)
    <11ce>   DW_AT_name        : (indirect string, offset: 0x702): ada_main__e084
    <11d2>   DW_AT_decl_file   : 1
    <11d3>   DW_AT_decl_line   : 20
    <11d4>   DW_AT_decl_column : 4
    <11d5>   DW_AT_linkage_name: (indirect string, offset: 0x186c): system__object_reader_E
    <11d9>   DW_AT_type        : <0x10f1>
    <11dd>   DW_AT_external    : 1
    <11dd>   DW_AT_declaration : 1
 <1><11dd>: Abbrev Number: 32 (DW_TAG_variable)
    <11de>   DW_AT_name        : (indirect string, offset: 0x154b): ada_main__e053
    <11e2>   DW_AT_decl_file   : 1
    <11e3>   DW_AT_decl_line   : 21
    <11e4>   DW_AT_decl_column : 4
    <11e5>   DW_AT_linkage_name: (indirect string, offset: 0x199): system__dwarf_lines_E
    <11e9>   DW_AT_type        : <0x10ec>
    <11ed>   DW_AT_external    : 1
    <11ed>   DW_AT_declaration : 1
 <1><11ed>: Abbrev Number: 32 (DW_TAG_variable)
    <11ee>   DW_AT_name        : (indirect string, offset: 0x1ce8): ada_main__e042
    <11f2>   DW_AT_decl_file   : 1
    <11f3>   DW_AT_decl_line   : 22
    <11f4>   DW_AT_decl_column : 4
    <11f5>   DW_AT_linkage_name: (indirect string, offset: 0x148c): system__traceback__symbolic_E
    <11f9>   DW_AT_type        : <0x10e7>
    <11fd>   DW_AT_external    : 1
    <11fd>   DW_AT_declaration : 1
 <1><11fd>: Abbrev Number: 36 (DW_TAG_variable)
    <11fe>   DW_AT_name        : (indirect string, offset: 0x1469): ada_main__sec_default_sized_stacks
    <1202>   DW_AT_decl_file   : 1
    <1203>   DW_AT_decl_line   : 24
    <1204>   DW_AT_decl_column : 4
    <1205>   DW_AT_type        : <0x53d>
    <1209>   DW_AT_location    : 9 byte block: 3 80 52 0 0 0 0 0 0 	(DW_OP_addr: 5280)
 <1><1213>: Abbrev Number: 36 (DW_TAG_variable)
    <1214>   DW_AT_name        : (indirect string, offset: 0x140f): ada_main__local_priority_specific_dispatching
    <1218>   DW_AT_decl_file   : 1
    <1219>   DW_AT_decl_line   : 26
    <121a>   DW_AT_decl_column : 4
    <121b>   DW_AT_type        : <0x57e>
    <121f>   DW_AT_location    : 9 byte block: 3 d8 31 0 0 0 0 0 0 	(DW_OP_addr: 31d8)
 <1><1229>: Abbrev Number: 36 (DW_TAG_variable)
    <122a>   DW_AT_name        : (indirect string, offset: 0xc85): ada_main__local_interrupt_states
    <122e>   DW_AT_decl_file   : 1
    <122f>   DW_AT_decl_line   : 27
    <1230>   DW_AT_decl_column : 4
