
mult_int.o:     file format elf32-littlearm
mult_int.o
architecture: arm, flags 0x00000011:
HAS_RELOC, HAS_SYMS
start address 0x00000000
private flags = 5000000: [Version5 EABI]

Sections:
Idx Name          Size      VMA       LMA       File off  Algn
  0 .group        00000008  00000000  00000000  00000034  2**2
                  CONTENTS, READONLY, EXCLUDE, GROUP, LINK_ONCE_DISCARD
  1 .group        00000008  00000000  00000000  0000003c  2**2
                  CONTENTS, READONLY, EXCLUDE, GROUP, LINK_ONCE_DISCARD
  2 .group        00000008  00000000  00000000  00000044  2**2
                  CONTENTS, READONLY, EXCLUDE, GROUP, LINK_ONCE_DISCARD
  3 .group        00000008  00000000  00000000  0000004c  2**2
                  CONTENTS, READONLY, EXCLUDE, GROUP, LINK_ONCE_DISCARD
  4 .group        00000008  00000000  00000000  00000054  2**2
                  CONTENTS, READONLY, EXCLUDE, GROUP, LINK_ONCE_DISCARD
  5 .group        00000008  00000000  00000000  0000005c  2**2
                  CONTENTS, READONLY, EXCLUDE, GROUP, LINK_ONCE_DISCARD
  6 .group        00000008  00000000  00000000  00000064  2**2
                  CONTENTS, READONLY, EXCLUDE, GROUP, LINK_ONCE_DISCARD
  7 .group        00000008  00000000  00000000  0000006c  2**2
                  CONTENTS, READONLY, EXCLUDE, GROUP, LINK_ONCE_DISCARD
  8 .group        00000008  00000000  00000000  00000074  2**2
                  CONTENTS, READONLY, EXCLUDE, GROUP, LINK_ONCE_DISCARD

   8:	7c020001 	stcvc	0, cr0, [r2], {1}
   c:	000d0c0e 	andeq	r0, sp, lr, lsl #24
  10:	0000001c 	andeq	r0, r0, ip, lsl r0
	...
			14: R_ARM_ABS32	.debug_frame
			18: R_ARM_ABS32	.text
	b = 3;
  1c:	00000048 	andeq	r0, r0, r8, asr #32
  20:	8b040e42 	blhi	103930 <wm4.0.bde7353c34e63c5c057d27e93dc901c3+0x103930>
	c = a * b;
  24:	0b0d4201 	bleq	350830 <wm4.0.bde7353c34e63c5c057d27e93dc901c3+0x350830>
  28:	420d0d5c 	andmi	r0, sp, #92, 26	; 0x1700
  2c:	00000ecb 	andeq	r0, r0, fp, asr #29

Disassembly of section .ARM.attributes:

00000000 <.ARM.attributes>:
{
   0:	00002e41 	andeq	r2, r0, r1, asr #28
   4:	61656100 	cmnvs	r5, r0, lsl #2
   8:	01006962 	tsteq	r0, r2, ror #18
   c:	00000024 	andeq	r0, r0, r4, lsr #32
  10:	06003605 	streq	r3, [r0], -r5, lsl #12
	a = 2;
  14:	09010806 	stmdbeq	r1, {r1, r2, fp}
  18:	12020a01 	andne	r0, r2, #4096	; 0x1000
	b = 3;
  1c:	15011404 	strne	r1, [r1, #-1028]	; 0xfffffbfc
  20:	18031701 	stmdane	r3, {r0, r8, r9, sl, ip}
	c = a * b;
  24:	1a011901 	bne	46430 <wm4.0.bde7353c34e63c5c057d27e93dc901c3+0x46430>
  28:	1e011c02 	cdpne	12, 0, cr1, cr1, cr2, {0}
  2c:	Address 0x0000002c is out of bounds.

Contents of the .debug_info section:

  Compilation Unit @ offset 0x0:
   Length:        0x375 (32-bit)
   Version:       4
   Abbrev Offset: 0x0
   Pointer Size:  4
 <0><b>: Abbrev Number: 1 (DW_TAG_compile_unit)
    <c>   DW_AT_producer    : (indirect string, offset: 0x31e0): GNU C11 6.3.0 20170516 -march=armv6 -mfloat-abi=hard -mfpu=vfp -mtls-dialect=gnu -ggdb3
    <10>   DW_AT_language    : 12	(ANSI C99)
    <11>   DW_AT_name        : (indirect string, offset: 0x3238): mult_int.c
    <15>   DW_AT_comp_dir    : (indirect string, offset: 0x3298): /home/pi/Engineering/GITHUB/Disassembling-Binaries/C/ARM_architecture/ARM32/Integer_Operations/Mult_Int/With_Debug_Info
    <19>   DW_AT_low_pc      : 0x0
    <1d>   DW_AT_high_pc     : 0x48
    <21>   DW_AT_stmt_list   : 0x0
    <25>   DW_AT_GNU_macros  : 0x0
 <1><29>: Abbrev Number: 2 (DW_TAG_typedef)
    <2a>   DW_AT_name        : (indirect string, offset: 0xff): size_t
    <2e>   DW_AT_decl_file   : 2
    <2f>   DW_AT_decl_line   : 216
    <30>   DW_AT_type        : <0x34>
 <1><34>: Abbrev Number: 3 (DW_TAG_base_type)
    <35>   DW_AT_byte_size   : 4
    <36>   DW_AT_encoding    : 7	(unsigned)
    <37>   DW_AT_name        : (indirect string, offset: 0x29b6): unsigned int
 <1><3b>: Abbrev Number: 3 (DW_TAG_base_type)
    <3c>   DW_AT_byte_size   : 1
    <3d>   DW_AT_encoding    : 8	(unsigned char)
    <3e>   DW_AT_name        : (indirect string, offset: 0x2e3f): unsigned char
 <1><42>: Abbrev Number: 3 (DW_TAG_base_type)
    <43>   DW_AT_byte_size   : 2
    <44>   DW_AT_encoding    : 7	(unsigned)
    <45>   DW_AT_name        : (indirect string, offset: 0x4641): short unsigned int
 <1><49>: Abbrev Number: 3 (DW_TAG_base_type)
    <4a>   DW_AT_byte_size   : 4
    <4b>   DW_AT_encoding    : 7	(unsigned)
    <4c>   DW_AT_name        : (indirect string, offset: 0x34aa): long unsigned int
 <1><50>: Abbrev Number: 3 (DW_TAG_base_type)
    <51>   DW_AT_byte_size   : 1
    <52>   DW_AT_encoding    : 6	(signed char)
    <53>   DW_AT_name        : (indirect string, offset: 0x103c): signed char
 <1><57>: Abbrev Number: 3 (DW_TAG_base_type)
    <58>   DW_AT_byte_size   : 2
    <59>   DW_AT_encoding    : 5	(signed)
    <5a>   DW_AT_name        : (indirect string, offset: 0x3d1b): short int
 <1><5e>: Abbrev Number: 4 (DW_TAG_base_type)
    <5f>   DW_AT_byte_size   : 4
    <60>   DW_AT_encoding    : 5	(signed)
    <61>   DW_AT_name        : int
 <1><65>: Abbrev Number: 3 (DW_TAG_base_type)
    <66>   DW_AT_byte_size   : 8
    <67>   DW_AT_encoding    : 5	(signed)
    <68>   DW_AT_name        : (indirect string, offset: 0x2562): long long int
 <1><6c>: Abbrev Number: 3 (DW_TAG_base_type)
    <6d>   DW_AT_byte_size   : 8
    <6e>   DW_AT_encoding    : 7	(unsigned)
    <6f>   DW_AT_name        : (indirect string, offset: 0x33c3): long long unsigned int
 <1><73>: Abbrev Number: 2 (DW_TAG_typedef)
    <74>   DW_AT_name        : (indirect string, offset: 0x21fb): __quad_t
    <78>   DW_AT_decl_file   : 3
    <79>   DW_AT_decl_line   : 55
    <7a>   DW_AT_type        : <0x65>
 <1><7e>: Abbrev Number: 2 (DW_TAG_typedef)
    <7f>   DW_AT_name        : (indirect string, offset: 0x1bc2): __off_t
    <83>   DW_AT_decl_file   : 3
    <84>   DW_AT_decl_line   : 131
    <85>   DW_AT_type        : <0x89>
 <1><89>: Abbrev Number: 3 (DW_TAG_base_type)
    <8a>   DW_AT_byte_size   : 4
    <8b>   DW_AT_encoding    : 5	(signed)
    <8c>   DW_AT_name        : (indirect string, offset: 0xb35): long int
 <1><90>: Abbrev Number: 2 (DW_TAG_typedef)
    <91>   DW_AT_name        : (indirect string, offset: 0x13f7): __off64_t
    <95>   DW_AT_decl_file   : 3
    <96>   DW_AT_decl_line   : 132
    <97>   DW_AT_type        : <0x73>
 <1><9b>: Abbrev Number: 3 (DW_TAG_base_type)
    <9c>   DW_AT_byte_size   : 4
    <9d>   DW_AT_encoding    : 7	(unsigned)
    <9e>   DW_AT_name        : (indirect string, offset: 0x118): sizetype
 <1><a2>: Abbrev Number: 5 (DW_TAG_pointer_type)
    <a3>   DW_AT_byte_size   : 4
 <1><a4>: Abbrev Number: 6 (DW_TAG_pointer_type)
    <a5>   DW_AT_byte_size   : 4
    <a6>   DW_AT_type        : <0xaa>
 <1><aa>: Abbrev Number: 3 (DW_TAG_base_type)
    <ab>   DW_AT_byte_size   : 1
    <ac>   DW_AT_encoding    : 8	(unsigned char)
    <ad>   DW_AT_name        : (indirect string, offset: 0x151a): char
 <1><b1>: Abbrev Number: 7 (DW_TAG_const_type)
    <b2>   DW_AT_type        : <0xaa>
 <1><b6>: Abbrev Number: 8 (DW_TAG_structure_type)
    <b7>   DW_AT_name        : (indirect string, offset: 0x657): _IO_FILE
    <bb>   DW_AT_byte_size   : 152
    <bc>   DW_AT_decl_file   : 4
    <bd>   DW_AT_decl_line   : 241
    <be>   DW_AT_sibling     : <0x233>
 <2><c2>: Abbrev Number: 9 (DW_TAG_member)
    <c3>   DW_AT_name        : (indirect string, offset: 0x2d08): _flags
    <c7>   DW_AT_decl_file   : 4
    <c8>   DW_AT_decl_line   : 242
    <c9>   DW_AT_type        : <0x5e>
    <cd>   DW_AT_data_member_location: 0
 <2><ce>: Abbrev Number: 9 (DW_TAG_member)
    <cf>   DW_AT_name        : (indirect string, offset: 0x17e9): _IO_read_ptr
    <d3>   DW_AT_decl_file   : 4
    <d4>   DW_AT_decl_line   : 247
    <d5>   DW_AT_type        : <0xa4>
    <d9>   DW_AT_data_member_location: 4
 <2><da>: Abbrev Number: 9 (DW_TAG_member)
    <db>   DW_AT_name        : (indirect string, offset: 0x42b7): _IO_read_end
    <df>   DW_AT_decl_file   : 4
    <e0>   DW_AT_decl_line   : 248
    <e1>   DW_AT_type        : <0xa4>
    <e5>   DW_AT_data_member_location: 8
 <2><e6>: Abbrev Number: 9 (DW_TAG_member)
    <e7>   DW_AT_name        : (indirect string, offset: 0x5bd): _IO_read_base
    <eb>   DW_AT_decl_file   : 4
    <ec>   DW_AT_decl_line   : 249
    <ed>   DW_AT_type        : <0xa4>
    <f1>   DW_AT_data_member_location: 12
 <2><f2>: Abbrev Number: 9 (DW_TAG_member)
    <f3>   DW_AT_name        : (indirect string, offset: 0x56a): _IO_write_base
    <f7>   DW_AT_decl_file   : 4
    <f8>   DW_AT_decl_line   : 250
    <f9>   DW_AT_type        : <0xa4>
    <fd>   DW_AT_data_member_location: 16
 <2><fe>: Abbrev Number: 9 (DW_TAG_member)
    <ff>   DW_AT_name        : (indirect string, offset: 0x470a): _IO_write_ptr
    <103>   DW_AT_decl_file   : 4
    <104>   DW_AT_decl_line   : 251
    <105>   DW_AT_type        : <0xa4>
    <109>   DW_AT_data_member_location: 20
 <2><10a>: Abbrev Number: 9 (DW_TAG_member)
    <10b>   DW_AT_name        : (indirect string, offset: 0x26d5): _IO_write_end
    <10f>   DW_AT_decl_file   : 4
    <110>   DW_AT_decl_line   : 252
    <111>   DW_AT_type        : <0xa4>
    <115>   DW_AT_data_member_location: 24
 <2><116>: Abbrev Number: 9 (DW_TAG_member)
    <117>   DW_AT_name        : (indirect string, offset: 0x2935): _IO_buf_base
    <11b>   DW_AT_decl_file   : 4
    <11c>   DW_AT_decl_line   : 253
    <11d>   DW_AT_type        : <0xa4>
    <121>   DW_AT_data_member_location: 28
 <2><122>: Abbrev Number: 9 (DW_TAG_member)
    <123>   DW_AT_name        : (indirect string, offset: 0x3a50): _IO_buf_end
    <127>   DW_AT_decl_file   : 4
    <128>   DW_AT_decl_line   : 254
    <129>   DW_AT_type        : <0xa4>
    <12d>   DW_AT_data_member_location: 32
 <2><12e>: Abbrev Number: 10 (DW_TAG_member)
    <12f>   DW_AT_name        : (indirect string, offset: 0x70f): _IO_save_base
    <133>   DW_AT_decl_file   : 4
    <134>   DW_AT_decl_line   : 256
    <136>   DW_AT_type        : <0xa4>
    <13a>   DW_AT_data_member_location: 36
 <2><13b>: Abbrev Number: 10 (DW_TAG_member)
    <13c>   DW_AT_name        : (indirect string, offset: 0x37d6): _IO_backup_base
    <140>   DW_AT_decl_file   : 4
    <141>   DW_AT_decl_line   : 257
    <143>   DW_AT_type        : <0xa4>
    <147>   DW_AT_data_member_location: 40
 <2><148>: Abbrev Number: 10 (DW_TAG_member)
    <149>   DW_AT_name        : (indirect string, offset: 0x3f9): _IO_save_end
    <14d>   DW_AT_decl_file   : 4
    <14e>   DW_AT_decl_line   : 258
    <150>   DW_AT_type        : <0xa4>
    <154>   DW_AT_data_member_location: 44
 <2><155>: Abbrev Number: 10 (DW_TAG_member)
    <156>   DW_AT_name        : (indirect string, offset: 0x1a11): _markers
    <15a>   DW_AT_decl_file   : 4
    <15b>   DW_AT_decl_line   : 260
    <15d>   DW_AT_type        : <0x26b>
    <161>   DW_AT_data_member_location: 48
 <2><162>: Abbrev Number: 10 (DW_TAG_member)
    <163>   DW_AT_name        : (indirect string, offset: 0x869): _chain
    <167>   DW_AT_decl_file   : 4
    <168>   DW_AT_decl_line   : 262
    <16a>   DW_AT_type        : <0x271>
    <16e>   DW_AT_data_member_location: 52
 <2><16f>: Abbrev Number: 10 (DW_TAG_member)
    <170>   DW_AT_name        : (indirect string, offset: 0x43d9): _fileno
    <174>   DW_AT_decl_file   : 4
    <175>   DW_AT_decl_line   : 264
    <177>   DW_AT_type        : <0x5e>
    <17b>   DW_AT_data_member_location: 56
 <2><17c>: Abbrev Number: 10 (DW_TAG_member)
    <17d>   DW_AT_name        : (indirect string, offset: 0x295e): _flags2
    <181>   DW_AT_decl_file   : 4
    <182>   DW_AT_decl_line   : 268
    <184>   DW_AT_type        : <0x5e>
    <188>   DW_AT_data_member_location: 60
 <2><189>: Abbrev Number: 10 (DW_TAG_member)
    <18a>   DW_AT_name        : (indirect string, offset: 0x239b): _old_offset
    <18e>   DW_AT_decl_file   : 4
    <18f>   DW_AT_decl_line   : 270
    <191>   DW_AT_type        : <0x7e>
    <195>   DW_AT_data_member_location: 64
 <2><196>: Abbrev Number: 10 (DW_TAG_member)
    <197>   DW_AT_name        : (indirect string, offset: 0x8a2): _cur_column
    <19b>   DW_AT_decl_file   : 4
    <19c>   DW_AT_decl_line   : 274
    <19e>   DW_AT_type        : <0x42>
    <1a2>   DW_AT_data_member_location: 68
 <2><1a3>: Abbrev Number: 10 (DW_TAG_member)
    <1a4>   DW_AT_name        : (indirect string, offset: 0x3e4a): _vtable_offset
    <1a8>   DW_AT_decl_file   : 4
    <1a9>   DW_AT_decl_line   : 275
    <1ab>   DW_AT_type        : <0x50>
    <1af>   DW_AT_data_member_location: 70
 <2><1b0>: Abbrev Number: 10 (DW_TAG_member)
    <1b1>   DW_AT_name        : (indirect string, offset: 0x37f5): _shortbuf
    <1b5>   DW_AT_decl_file   : 4
    <1b6>   DW_AT_decl_line   : 276
    <1b8>   DW_AT_type        : <0x277>
    <1bc>   DW_AT_data_member_location: 71
 <2><1bd>: Abbrev Number: 10 (DW_TAG_member)
    <1be>   DW_AT_name        : (indirect string, offset: 0x62e): _lock
    <1c2>   DW_AT_decl_file   : 4
    <1c3>   DW_AT_decl_line   : 280
    <1c5>   DW_AT_type        : <0x287>
    <1c9>   DW_AT_data_member_location: 72
 <2><1ca>: Abbrev Number: 10 (DW_TAG_member)
    <1cb>   DW_AT_name        : (indirect string, offset: 0x1c95): _offset
    <1cf>   DW_AT_decl_file   : 4
    <1d0>   DW_AT_decl_line   : 289
    <1d2>   DW_AT_type        : <0x90>
    <1d6>   DW_AT_data_member_location: 80
 <2><1d7>: Abbrev Number: 10 (DW_TAG_member)
    <1d8>   DW_AT_name        : (indirect string, offset: 0x48f3): __pad1
    <1dc>   DW_AT_decl_file   : 4
    <1dd>   DW_AT_decl_line   : 297
    <1df>   DW_AT_type        : <0xa2>
    <1e3>   DW_AT_data_member_location: 88
 <2><1e4>: Abbrev Number: 10 (DW_TAG_member)
    <1e5>   DW_AT_name        : (indirect string, offset: 0x2af4): __pad2
    <1e9>   DW_AT_decl_file   : 4
    <1ea>   DW_AT_decl_line   : 298
    <1ec>   DW_AT_type        : <0xa2>
    <1f0>   DW_AT_data_member_location: 92
 <2><1f1>: Abbrev Number: 10 (DW_TAG_member)
    <1f2>   DW_AT_name        : (indirect string, offset: 0x2afb): __pad3
    <1f6>   DW_AT_decl_file   : 4
    <1f7>   DW_AT_decl_line   : 299
    <1f9>   DW_AT_type        : <0xa2>
    <1fd>   DW_AT_data_member_location: 96
 <2><1fe>: Abbrev Number: 10 (DW_TAG_member)
    <1ff>   DW_AT_name        : (indirect string, offset: 0x2b02): __pad4
    <203>   DW_AT_decl_file   : 4
    <204>   DW_AT_decl_line   : 300
    <206>   DW_AT_type        : <0xa2>
    <20a>   DW_AT_data_member_location: 100
 <2><20b>: Abbrev Number: 10 (DW_TAG_member)
    <20c>   DW_AT_name        : (indirect string, offset: 0x2b09): __pad5
    <210>   DW_AT_decl_file   : 4
    <211>   DW_AT_decl_line   : 302
    <213>   DW_AT_type        : <0x29>
    <217>   DW_AT_data_member_location: 104
 <2><218>: Abbrev Number: 10 (DW_TAG_member)
    <219>   DW_AT_name        : (indirect string, offset: 0x2da8): _mode
    <21d>   DW_AT_decl_file   : 4
    <21e>   DW_AT_decl_line   : 303
    <220>   DW_AT_type        : <0x5e>
    <224>   DW_AT_data_member_location: 108
 <2><225>: Abbrev Number: 10 (DW_TAG_member)
    <226>   DW_AT_name        : (indirect string, offset: 0x21d6): _unused2
    <22a>   DW_AT_decl_file   : 4
    <22b>   DW_AT_decl_line   : 305
    <22d>   DW_AT_type        : <0x28d>
    <231>   DW_AT_data_member_location: 112
 <2><232>: Abbrev Number: 0
 <1><233>: Abbrev Number: 11 (DW_TAG_typedef)
    <234>   DW_AT_name        : (indirect string, offset: 0x1636): _IO_lock_t
    <238>   DW_AT_decl_file   : 4
    <239>   DW_AT_decl_line   : 150
 <1><23a>: Abbrev Number: 8 (DW_TAG_structure_type)
    <23b>   DW_AT_name        : (indirect string, offset: 0xc97): _IO_marker
    <23f>   DW_AT_byte_size   : 12
    <240>   DW_AT_decl_file   : 4
    <241>   DW_AT_decl_line   : 156
    <242>   DW_AT_sibling     : <0x26b>
 <2><246>: Abbrev Number: 9 (DW_TAG_member)
    <247>   DW_AT_name        : (indirect string, offset: 0x3901): _next
    <24b>   DW_AT_decl_file   : 4
    <24c>   DW_AT_decl_line   : 157
    <24d>   DW_AT_type        : <0x26b>
    <251>   DW_AT_data_member_location: 0
 <2><252>: Abbrev Number: 9 (DW_TAG_member)
    <253>   DW_AT_name        : (indirect string, offset: 0x2b28): _sbuf
    <257>   DW_AT_decl_file   : 4
    <258>   DW_AT_decl_line   : 158
    <259>   DW_AT_type        : <0x271>
    <25d>   DW_AT_data_member_location: 4
 <2><25e>: Abbrev Number: 9 (DW_TAG_member)
    <25f>   DW_AT_name        : (indirect string, offset: 0x18b1): _pos
    <263>   DW_AT_decl_file   : 4
    <264>   DW_AT_decl_line   : 162
    <265>   DW_AT_type        : <0x5e>
    <269>   DW_AT_data_member_location: 8
 <2><26a>: Abbrev Number: 0
 <1><26b>: Abbrev Number: 6 (DW_TAG_pointer_type)
    <26c>   DW_AT_byte_size   : 4
    <26d>   DW_AT_type        : <0x23a>
 <1><271>: Abbrev Number: 6 (DW_TAG_pointer_type)
    <272>   DW_AT_byte_size   : 4
    <273>   DW_AT_type        : <0xb6>
 <1><277>: Abbrev Number: 12 (DW_TAG_array_type)
    <278>   DW_AT_type        : <0xaa>
    <27c>   DW_AT_sibling     : <0x287>
 <2><280>: Abbrev Number: 13 (DW_TAG_subrange_type)
    <281>   DW_AT_type        : <0x9b>
    <285>   DW_AT_upper_bound : 0
 <2><286>: Abbrev Number: 0
 <1><287>: Abbrev Number: 6 (DW_TAG_pointer_type)
    <288>   DW_AT_byte_size   : 4
    <289>   DW_AT_type        : <0x233>
 <1><28d>: Abbrev Number: 12 (DW_TAG_array_type)
    <28e>   DW_AT_type        : <0xaa>
    <292>   DW_AT_sibling     : <0x29d>
 <2><296>: Abbrev Number: 13 (DW_TAG_subrange_type)
    <297>   DW_AT_type        : <0x9b>
    <29b>   DW_AT_upper_bound : 39
 <2><29c>: Abbrev Number: 0
 <1><29d>: Abbrev Number: 14 (DW_TAG_structure_type)
    <29e>   DW_AT_name        : (indirect string, offset: 0x1429): _IO_FILE_plus
    <2a2>   DW_AT_declaration : 1
 <1><2a2>: Abbrev Number: 15 (DW_TAG_variable)
    <2a3>   DW_AT_name        : (indirect string, offset: 0x37c7): _IO_2_1_stdin_
    <2a7>   DW_AT_decl_file   : 4
    <2a8>   DW_AT_decl_line   : 315
    <2aa>   DW_AT_type        : <0x29d>
    <2ae>   DW_AT_external    : 1
    <2ae>   DW_AT_declaration : 1
 <1><2ae>: Abbrev Number: 15 (DW_TAG_variable)
    <2af>   DW_AT_name        : (indirect string, offset: 0x383e): _IO_2_1_stdout_
    <2b3>   DW_AT_decl_file   : 4
    <2b4>   DW_AT_decl_line   : 316
    <2b6>   DW_AT_type        : <0x29d>
    <2ba>   DW_AT_external    : 1
    <2ba>   DW_AT_declaration : 1
 <1><2ba>: Abbrev Number: 15 (DW_TAG_variable)
    <2bb>   DW_AT_name        : (indirect string, offset: 0x3d04): _IO_2_1_stderr_
    <2bf>   DW_AT_decl_file   : 4
    <2c0>   DW_AT_decl_line   : 317
    <2c2>   DW_AT_type        : <0x29d>
    <2c6>   DW_AT_external    : 1
    <2c6>   DW_AT_declaration : 1
 <1><2c6>: Abbrev Number: 6 (DW_TAG_pointer_type)
    <2c7>   DW_AT_byte_size   : 4
    <2c8>   DW_AT_type        : <0xb1>
 <1><2cc>: Abbrev Number: 7 (DW_TAG_const_type)
    <2cd>   DW_AT_type        : <0x2c6>
 <1><2d1>: Abbrev Number: 16 (DW_TAG_variable)
    <2d2>   DW_AT_name        : (indirect string, offset: 0x18dd): stdin
    <2d6>   DW_AT_decl_file   : 5
    <2d7>   DW_AT_decl_line   : 170
    <2d8>   DW_AT_type        : <0x271>
    <2dc>   DW_AT_external    : 1
    <2dc>   DW_AT_declaration : 1
 <1><2dc>: Abbrev Number: 16 (DW_TAG_variable)
    <2dd>   DW_AT_name        : (indirect string, offset: 0x4654): stdout
    <2e1>   DW_AT_decl_file   : 5
    <2e2>   DW_AT_decl_line   : 171
    <2e3>   DW_AT_type        : <0x271>
    <2e7>   DW_AT_external    : 1
    <2e7>   DW_AT_declaration : 1
 <1><2e7>: Abbrev Number: 16 (DW_TAG_variable)
    <2e8>   DW_AT_name        : (indirect string, offset: 0x3d14): stderr
    <2ec>   DW_AT_decl_file   : 5
    <2ed>   DW_AT_decl_line   : 172
    <2ee>   DW_AT_type        : <0x271>
    <2f2>   DW_AT_external    : 1
    <2f2>   DW_AT_declaration : 1
 <1><2f2>: Abbrev Number: 16 (DW_TAG_variable)
    <2f3>   DW_AT_name        : (indirect string, offset: 0x8ae): sys_nerr
    <2f7>   DW_AT_decl_file   : 6
    <2f8>   DW_AT_decl_line   : 26
    <2f9>   DW_AT_type        : <0x5e>
    <2fd>   DW_AT_external    : 1
    <2fd>   DW_AT_declaration : 1
 <1><2fd>: Abbrev Number: 12 (DW_TAG_array_type)
    <2fe>   DW_AT_type        : <0x2cc>
    <302>   DW_AT_sibling     : <0x308>
 <2><306>: Abbrev Number: 17 (DW_TAG_subrange_type)
 <2><307>: Abbrev Number: 0
 <1><308>: Abbrev Number: 7 (DW_TAG_const_type)
    <309>   DW_AT_type        : <0x2fd>
 <1><30d>: Abbrev Number: 16 (DW_TAG_variable)
    <30e>   DW_AT_name        : (indirect string, offset: 0x1945): sys_errlist
    <312>   DW_AT_decl_file   : 6
    <313>   DW_AT_decl_line   : 27
