
add.o:     file format elf32-i386
add.o
architecture: i386, flags 0x00000011:
HAS_RELOC, HAS_SYMS
start address 0x00000000

Sections:
Idx Name          Size      VMA       LMA       File off  Algn
  0 .group        00000008  00000000  00000000  00000034  2**2
                  CONTENTS, READONLY, GROUP, LINK_ONCE_DISCARD
  1 .group        0000000c  00000000  00000000  0000003c  2**2
                  CONTENTS, READONLY, GROUP, LINK_ONCE_DISCARD
  2 .group        0000000c  00000000  00000000  00000048  2**2
                  CONTENTS, READONLY, GROUP, LINK_ONCE_DISCARD
  3 .group        0000000c  00000000  00000000  00000054  2**2
                  CONTENTS, READONLY, GROUP, LINK_ONCE_DISCARD
  4 .group        0000000c  00000000  00000000  00000060  2**2
                  CONTENTS, READONLY, GROUP, LINK_ONCE_DISCARD
  5 .group        0000000c  00000000  00000000  0000006c  2**2
                  CONTENTS, READONLY, GROUP, LINK_ONCE_DISCARD
  6 .group        0000000c  00000000  00000000  00000078  2**2
                  CONTENTS, READONLY, GROUP, LINK_ONCE_DISCARD
  7 .group        0000000c  00000000  00000000  00000084  2**2
                  CONTENTS, READONLY, GROUP, LINK_ONCE_DISCARD
  8 .group        0000000c  00000000  00000000  00000090  2**2
                  CONTENTS, READONLY, GROUP, LINK_ONCE_DISCARD
  9 .group        0000000c  00000000  00000000  0000009c  2**2
                  CONTENTS, READONLY, GROUP, LINK_ONCE_DISCARD

  11:	0c 04                	or     al,0x4
  13:	04 88                	add    al,0x88
  15:	01 00                	add    DWORD PTR [eax],eax
  17:	00 1c 00             	add    BYTE PTR [eax+eax*1],bl
  1a:	00 00                	add    BYTE PTR [eax],al
  1c:	1c 00                	sbb    al,0x0
  1e:	00 00                	add    BYTE PTR [eax],al
  20:	00 00                	add    BYTE PTR [eax],al
			20: R_386_PC32	.text
  22:	00 00                	add    BYTE PTR [eax],al
  24:	30 00                	xor    BYTE PTR [eax],al
  26:	00 00                	add    BYTE PTR [eax],al
  28:	00 41 0e             	add    BYTE PTR [ecx+0xe],al
  2b:	08 85 02 42 0d 05    	or     BYTE PTR [ebp+0x50d4202],al
  31:	6c                   	ins    BYTE PTR es:[edi],dx
  32:	c5 0c 04             	lds    ecx,FWORD PTR [esp+eax*1]
  35:	04 00                	add    al,0x0
  37:	00 10                	add    BYTE PTR [eax],dl
  39:	00 00                	add    BYTE PTR [eax],al
  3b:	00 3c 00             	add    BYTE PTR [eax+eax*1],bh
  3e:	00 00                	add    BYTE PTR [eax],al
  40:	00 00                	add    BYTE PTR [eax],al
			40: R_386_PC32	.text.__x86.get_pc_thunk.ax
  42:	00 00                	add    BYTE PTR [eax],al
  44:	04 00                	add    al,0x0
  46:	00 00                	add    BYTE PTR [eax],al
  48:	00 00                	add    BYTE PTR [eax],al
	...
Contents of the .debug_info section:

  Compilation Unit @ offset 0x0:
   Length:        0x371 (32-bit)
   Version:       4
   Abbrev Offset: 0x0
   Pointer Size:  4
 <0><b>: Abbrev Number: 1 (DW_TAG_compile_unit)
    <c>   DW_AT_producer    : (indirect string, offset: 0x1984): GNU C11 7.3.0 -m32 -mtune=generic -march=i686 -ggdb3 -fstack-protector-strong
    <10>   DW_AT_language    : 12	(ANSI C99)
    <11>   DW_AT_name        : (indirect string, offset: 0xe7c): add.c
    <15>   DW_AT_comp_dir    : (indirect string, offset: 0x2a67): /home/ubuntu/Engineering/Programming/Disassembling-Binaries/C/Intel_architecture/i386/With_Debug_Info
    <19>   DW_AT_low_pc      : 0x0
    <1d>   DW_AT_high_pc     : 0x30
    <21>   DW_AT_stmt_list   : 0x0
    <25>   DW_AT_GNU_macros  : 0x0
 <1><29>: Abbrev Number: 2 (DW_TAG_typedef)
    <2a>   DW_AT_name        : (indirect string, offset: 0x185c): size_t
    <2e>   DW_AT_decl_file   : 2
    <2f>   DW_AT_decl_line   : 216
    <30>   DW_AT_type        : <0x34>
 <1><34>: Abbrev Number: 3 (DW_TAG_base_type)
    <35>   DW_AT_byte_size   : 4
    <36>   DW_AT_encoding    : 7	(unsigned)
    <37>   DW_AT_name        : (indirect string, offset: 0x5d8): unsigned int
 <1><3b>: Abbrev Number: 3 (DW_TAG_base_type)
    <3c>   DW_AT_byte_size   : 1
    <3d>   DW_AT_encoding    : 8	(unsigned char)
    <3e>   DW_AT_name        : (indirect string, offset: 0x4084): unsigned char
 <1><42>: Abbrev Number: 3 (DW_TAG_base_type)
    <43>   DW_AT_byte_size   : 2
    <44>   DW_AT_encoding    : 7	(unsigned)
    <45>   DW_AT_name        : (indirect string, offset: 0x46af): short unsigned int
 <1><49>: Abbrev Number: 3 (DW_TAG_base_type)
    <4a>   DW_AT_byte_size   : 4
    <4b>   DW_AT_encoding    : 7	(unsigned)
    <4c>   DW_AT_name        : (indirect string, offset: 0x3bce): long unsigned int
 <1><50>: Abbrev Number: 3 (DW_TAG_base_type)
    <51>   DW_AT_byte_size   : 1
    <52>   DW_AT_encoding    : 6	(signed char)
    <53>   DW_AT_name        : (indirect string, offset: 0xe5e): signed char
 <1><57>: Abbrev Number: 3 (DW_TAG_base_type)
    <58>   DW_AT_byte_size   : 2
    <59>   DW_AT_encoding    : 5	(signed)
    <5a>   DW_AT_name        : (indirect string, offset: 0x32e6): short int
 <1><5e>: Abbrev Number: 4 (DW_TAG_base_type)
    <5f>   DW_AT_byte_size   : 4
    <60>   DW_AT_encoding    : 5	(signed)
    <61>   DW_AT_name        : int
 <1><65>: Abbrev Number: 3 (DW_TAG_base_type)
    <66>   DW_AT_byte_size   : 8
    <67>   DW_AT_encoding    : 5	(signed)
    <68>   DW_AT_name        : (indirect string, offset: 0x24bf): long long int
 <1><6c>: Abbrev Number: 3 (DW_TAG_base_type)
    <6d>   DW_AT_byte_size   : 8
    <6e>   DW_AT_encoding    : 7	(unsigned)
    <6f>   DW_AT_name        : (indirect string, offset: 0x10f2): long long unsigned int
 <1><73>: Abbrev Number: 2 (DW_TAG_typedef)
    <74>   DW_AT_name        : (indirect string, offset: 0x2980): __quad_t
    <78>   DW_AT_decl_file   : 3
    <79>   DW_AT_decl_line   : 55
    <7a>   DW_AT_type        : <0x65>
 <1><7e>: Abbrev Number: 2 (DW_TAG_typedef)
    <7f>   DW_AT_name        : (indirect string, offset: 0x4609): __off_t
    <83>   DW_AT_decl_file   : 3
    <84>   DW_AT_decl_line   : 140
    <85>   DW_AT_type        : <0x89>
 <1><89>: Abbrev Number: 3 (DW_TAG_base_type)
    <8a>   DW_AT_byte_size   : 4
    <8b>   DW_AT_encoding    : 5	(signed)
    <8c>   DW_AT_name        : (indirect string, offset: 0x3372): long int
 <1><90>: Abbrev Number: 2 (DW_TAG_typedef)
    <91>   DW_AT_name        : (indirect string, offset: 0x4dc9): __off64_t
    <95>   DW_AT_decl_file   : 3
    <96>   DW_AT_decl_line   : 141
    <97>   DW_AT_type        : <0x73>
 <1><9b>: Abbrev Number: 5 (DW_TAG_pointer_type)
    <9c>   DW_AT_byte_size   : 4
 <1><9d>: Abbrev Number: 6 (DW_TAG_pointer_type)
    <9e>   DW_AT_byte_size   : 4
    <9f>   DW_AT_type        : <0xa3>
 <1><a3>: Abbrev Number: 3 (DW_TAG_base_type)
    <a4>   DW_AT_byte_size   : 1
    <a5>   DW_AT_encoding    : 6	(signed char)
    <a6>   DW_AT_name        : (indirect string, offset: 0x28c): char
 <1><aa>: Abbrev Number: 7 (DW_TAG_const_type)
    <ab>   DW_AT_type        : <0xa3>
 <1><af>: Abbrev Number: 8 (DW_TAG_structure_type)
    <b0>   DW_AT_name        : (indirect string, offset: 0x1289): _IO_FILE
    <b4>   DW_AT_byte_size   : 148
    <b5>   DW_AT_decl_file   : 4
    <b6>   DW_AT_decl_line   : 245
    <b7>   DW_AT_sibling     : <0x22f>
 <2><bb>: Abbrev Number: 9 (DW_TAG_member)
    <bc>   DW_AT_name        : (indirect string, offset: 0x6fd): _flags
    <c0>   DW_AT_decl_file   : 4
    <c1>   DW_AT_decl_line   : 246
    <c2>   DW_AT_type        : <0x5e>
    <c6>   DW_AT_data_member_location: 0
 <2><c7>: Abbrev Number: 9 (DW_TAG_member)
    <c8>   DW_AT_name        : (indirect string, offset: 0x20d8): _IO_read_ptr
    <cc>   DW_AT_decl_file   : 4
    <cd>   DW_AT_decl_line   : 251
    <ce>   DW_AT_type        : <0x9d>
    <d2>   DW_AT_data_member_location: 4
 <2><d3>: Abbrev Number: 9 (DW_TAG_member)
    <d4>   DW_AT_name        : (indirect string, offset: 0x3214): _IO_read_end
    <d8>   DW_AT_decl_file   : 4
    <d9>   DW_AT_decl_line   : 252
    <da>   DW_AT_type        : <0x9d>
    <de>   DW_AT_data_member_location: 8
 <2><df>: Abbrev Number: 9 (DW_TAG_member)
    <e0>   DW_AT_name        : (indirect string, offset: 0x193a): _IO_read_base
    <e4>   DW_AT_decl_file   : 4
    <e5>   DW_AT_decl_line   : 253
    <e6>   DW_AT_type        : <0x9d>
    <ea>   DW_AT_data_member_location: 12
 <2><eb>: Abbrev Number: 9 (DW_TAG_member)
    <ec>   DW_AT_name        : (indirect string, offset: 0x208a): _IO_write_base
    <f0>   DW_AT_decl_file   : 4
    <f1>   DW_AT_decl_line   : 254
    <f2>   DW_AT_type        : <0x9d>
    <f6>   DW_AT_data_member_location: 16
 <2><f7>: Abbrev Number: 9 (DW_TAG_member)
    <f8>   DW_AT_name        : (indirect string, offset: 0x416d): _IO_write_ptr
    <fc>   DW_AT_decl_file   : 4
    <fd>   DW_AT_decl_line   : 255
    <fe>   DW_AT_type        : <0x9d>
    <102>   DW_AT_data_member_location: 20
 <2><103>: Abbrev Number: 10 (DW_TAG_member)
    <104>   DW_AT_name        : (indirect string, offset: 0x5ca): _IO_write_end
    <108>   DW_AT_decl_file   : 4
    <109>   DW_AT_decl_line   : 256
    <10b>   DW_AT_type        : <0x9d>
    <10f>   DW_AT_data_member_location: 24
 <2><110>: Abbrev Number: 10 (DW_TAG_member)
    <111>   DW_AT_name        : (indirect string, offset: 0x4d73): _IO_buf_base
    <115>   DW_AT_decl_file   : 4
    <116>   DW_AT_decl_line   : 257
    <118>   DW_AT_type        : <0x9d>
    <11c>   DW_AT_data_member_location: 28
 <2><11d>: Abbrev Number: 10 (DW_TAG_member)
    <11e>   DW_AT_name        : (indirect string, offset: 0x2e7): _IO_buf_end
    <122>   DW_AT_decl_file   : 4
    <123>   DW_AT_decl_line   : 258
    <125>   DW_AT_type        : <0x9d>
    <129>   DW_AT_data_member_location: 32
 <2><12a>: Abbrev Number: 10 (DW_TAG_member)
    <12b>   DW_AT_name        : (indirect string, offset: 0x2579): _IO_save_base
    <12f>   DW_AT_decl_file   : 4
    <130>   DW_AT_decl_line   : 260
    <132>   DW_AT_type        : <0x9d>
    <136>   DW_AT_data_member_location: 36
 <2><137>: Abbrev Number: 10 (DW_TAG_member)
    <138>   DW_AT_name        : (indirect string, offset: 0x4243): _IO_backup_base
    <13c>   DW_AT_decl_file   : 4
    <13d>   DW_AT_decl_line   : 261
    <13f>   DW_AT_type        : <0x9d>
    <143>   DW_AT_data_member_location: 40
 <2><144>: Abbrev Number: 10 (DW_TAG_member)
    <145>   DW_AT_name        : (indirect string, offset: 0xfc6): _IO_save_end
    <149>   DW_AT_decl_file   : 4
    <14a>   DW_AT_decl_line   : 262
    <14c>   DW_AT_type        : <0x9d>
    <150>   DW_AT_data_member_location: 44
 <2><151>: Abbrev Number: 10 (DW_TAG_member)
    <152>   DW_AT_name        : (indirect string, offset: 0x8f0): _markers
    <156>   DW_AT_decl_file   : 4
    <157>   DW_AT_decl_line   : 264
    <159>   DW_AT_type        : <0x267>
    <15d>   DW_AT_data_member_location: 48
 <2><15e>: Abbrev Number: 10 (DW_TAG_member)
    <15f>   DW_AT_name        : (indirect string, offset: 0x4a48): _chain
    <163>   DW_AT_decl_file   : 4
    <164>   DW_AT_decl_line   : 266
    <166>   DW_AT_type        : <0x26d>
    <16a>   DW_AT_data_member_location: 52
 <2><16b>: Abbrev Number: 10 (DW_TAG_member)
    <16c>   DW_AT_name        : (indirect string, offset: 0x1676): _fileno
    <170>   DW_AT_decl_file   : 4
    <171>   DW_AT_decl_line   : 268
    <173>   DW_AT_type        : <0x5e>
    <177>   DW_AT_data_member_location: 56
 <2><178>: Abbrev Number: 10 (DW_TAG_member)
    <179>   DW_AT_name        : (indirect string, offset: 0x4aeb): _flags2
    <17d>   DW_AT_decl_file   : 4
    <17e>   DW_AT_decl_line   : 272
    <180>   DW_AT_type        : <0x5e>
    <184>   DW_AT_data_member_location: 60
 <2><185>: Abbrev Number: 10 (DW_TAG_member)
    <186>   DW_AT_name        : (indirect string, offset: 0x3c47): _old_offset
    <18a>   DW_AT_decl_file   : 4
    <18b>   DW_AT_decl_line   : 274
    <18d>   DW_AT_type        : <0x7e>
    <191>   DW_AT_data_member_location: 64
 <2><192>: Abbrev Number: 10 (DW_TAG_member)
    <193>   DW_AT_name        : (indirect string, offset: 0x4c70): _cur_column
    <197>   DW_AT_decl_file   : 4
    <198>   DW_AT_decl_line   : 278
    <19a>   DW_AT_type        : <0x42>
    <19e>   DW_AT_data_member_location: 68
 <2><19f>: Abbrev Number: 10 (DW_TAG_member)
    <1a0>   DW_AT_name        : (indirect string, offset: 0x1863): _vtable_offset
    <1a4>   DW_AT_decl_file   : 4
    <1a5>   DW_AT_decl_line   : 279
    <1a7>   DW_AT_type        : <0x50>
    <1ab>   DW_AT_data_member_location: 70
 <2><1ac>: Abbrev Number: 10 (DW_TAG_member)
    <1ad>   DW_AT_name        : (indirect string, offset: 0x184): _shortbuf
    <1b1>   DW_AT_decl_file   : 4
    <1b2>   DW_AT_decl_line   : 280
    <1b4>   DW_AT_type        : <0x273>
    <1b8>   DW_AT_data_member_location: 71
 <2><1b9>: Abbrev Number: 10 (DW_TAG_member)
    <1ba>   DW_AT_name        : (indirect string, offset: 0x3b5b): _lock
    <1be>   DW_AT_decl_file   : 4
    <1bf>   DW_AT_decl_line   : 284
    <1c1>   DW_AT_type        : <0x283>
    <1c5>   DW_AT_data_member_location: 72
 <2><1c6>: Abbrev Number: 10 (DW_TAG_member)
    <1c7>   DW_AT_name        : (indirect string, offset: 0x1570): _offset
    <1cb>   DW_AT_decl_file   : 4
    <1cc>   DW_AT_decl_line   : 293
    <1ce>   DW_AT_type        : <0x90>
    <1d2>   DW_AT_data_member_location: 76
 <2><1d3>: Abbrev Number: 10 (DW_TAG_member)
    <1d4>   DW_AT_name        : (indirect string, offset: 0x2aff): __pad1
    <1d8>   DW_AT_decl_file   : 4
    <1d9>   DW_AT_decl_line   : 301
    <1db>   DW_AT_type        : <0x9b>
    <1df>   DW_AT_data_member_location: 84
 <2><1e0>: Abbrev Number: 10 (DW_TAG_member)
    <1e1>   DW_AT_name        : (indirect string, offset: 0x2b06): __pad2
    <1e5>   DW_AT_decl_file   : 4
    <1e6>   DW_AT_decl_line   : 302
    <1e8>   DW_AT_type        : <0x9b>
    <1ec>   DW_AT_data_member_location: 88
 <2><1ed>: Abbrev Number: 10 (DW_TAG_member)
    <1ee>   DW_AT_name        : (indirect string, offset: 0x2b0d): __pad3
    <1f2>   DW_AT_decl_file   : 4
    <1f3>   DW_AT_decl_line   : 303
    <1f5>   DW_AT_type        : <0x9b>
    <1f9>   DW_AT_data_member_location: 92
 <2><1fa>: Abbrev Number: 10 (DW_TAG_member)
    <1fb>   DW_AT_name        : (indirect string, offset: 0x2b14): __pad4
    <1ff>   DW_AT_decl_file   : 4
    <200>   DW_AT_decl_line   : 304
    <202>   DW_AT_type        : <0x9b>
    <206>   DW_AT_data_member_location: 96
 <2><207>: Abbrev Number: 10 (DW_TAG_member)
    <208>   DW_AT_name        : (indirect string, offset: 0x2b1b): __pad5
    <20c>   DW_AT_decl_file   : 4
    <20d>   DW_AT_decl_line   : 306
    <20f>   DW_AT_type        : <0x29>
    <213>   DW_AT_data_member_location: 100
 <2><214>: Abbrev Number: 10 (DW_TAG_member)
    <215>   DW_AT_name        : (indirect string, offset: 0x1f65): _mode
    <219>   DW_AT_decl_file   : 4
    <21a>   DW_AT_decl_line   : 307
    <21c>   DW_AT_type        : <0x5e>
    <220>   DW_AT_data_member_location: 104
 <2><221>: Abbrev Number: 10 (DW_TAG_member)
    <222>   DW_AT_name        : (indirect string, offset: 0x4d6a): _unused2
    <226>   DW_AT_decl_file   : 4
    <227>   DW_AT_decl_line   : 309
    <229>   DW_AT_type        : <0x289>
    <22d>   DW_AT_data_member_location: 108
 <2><22e>: Abbrev Number: 0
 <1><22f>: Abbrev Number: 11 (DW_TAG_typedef)
    <230>   DW_AT_name        : (indirect string, offset: 0x215): _IO_lock_t
    <234>   DW_AT_decl_file   : 4
    <235>   DW_AT_decl_line   : 154
 <1><236>: Abbrev Number: 8 (DW_TAG_structure_type)
    <237>   DW_AT_name        : (indirect string, offset: 0x247c): _IO_marker
    <23b>   DW_AT_byte_size   : 12
    <23c>   DW_AT_decl_file   : 4
    <23d>   DW_AT_decl_line   : 160
    <23e>   DW_AT_sibling     : <0x267>
 <2><242>: Abbrev Number: 9 (DW_TAG_member)
    <243>   DW_AT_name        : (indirect string, offset: 0x1aa6): _next
    <247>   DW_AT_decl_file   : 4
    <248>   DW_AT_decl_line   : 161
    <249>   DW_AT_type        : <0x267>
    <24d>   DW_AT_data_member_location: 0
 <2><24e>: Abbrev Number: 9 (DW_TAG_member)
    <24f>   DW_AT_name        : (indirect string, offset: 0x410f): _sbuf
    <253>   DW_AT_decl_file   : 4
    <254>   DW_AT_decl_line   : 162
    <255>   DW_AT_type        : <0x26d>
    <259>   DW_AT_data_member_location: 4
 <2><25a>: Abbrev Number: 9 (DW_TAG_member)
    <25b>   DW_AT_name        : (indirect string, offset: 0xef1): _pos
    <25f>   DW_AT_decl_file   : 4
    <260>   DW_AT_decl_line   : 166
    <261>   DW_AT_type        : <0x5e>
    <265>   DW_AT_data_member_location: 8
 <2><266>: Abbrev Number: 0
 <1><267>: Abbrev Number: 6 (DW_TAG_pointer_type)
    <268>   DW_AT_byte_size   : 4
    <269>   DW_AT_type        : <0x236>
 <1><26d>: Abbrev Number: 6 (DW_TAG_pointer_type)
    <26e>   DW_AT_byte_size   : 4
    <26f>   DW_AT_type        : <0xaf>
 <1><273>: Abbrev Number: 12 (DW_TAG_array_type)
    <274>   DW_AT_type        : <0xa3>
    <278>   DW_AT_sibling     : <0x283>
 <2><27c>: Abbrev Number: 13 (DW_TAG_subrange_type)
    <27d>   DW_AT_type        : <0x34>
    <281>   DW_AT_upper_bound : 0
 <2><282>: Abbrev Number: 0
 <1><283>: Abbrev Number: 6 (DW_TAG_pointer_type)
    <284>   DW_AT_byte_size   : 4
    <285>   DW_AT_type        : <0x22f>
 <1><289>: Abbrev Number: 12 (DW_TAG_array_type)
    <28a>   DW_AT_type        : <0xa3>
    <28e>   DW_AT_sibling     : <0x299>
 <2><292>: Abbrev Number: 13 (DW_TAG_subrange_type)
    <293>   DW_AT_type        : <0x34>
    <297>   DW_AT_upper_bound : 39
 <2><298>: Abbrev Number: 0
 <1><299>: Abbrev Number: 14 (DW_TAG_structure_type)
    <29a>   DW_AT_name        : (indirect string, offset: 0x37fe): _IO_FILE_plus
    <29e>   DW_AT_declaration : 1
 <1><29e>: Abbrev Number: 15 (DW_TAG_variable)
    <29f>   DW_AT_name        : (indirect string, offset: 0x3c71): _IO_2_1_stdin_
    <2a3>   DW_AT_decl_file   : 4
    <2a4>   DW_AT_decl_line   : 319
    <2a6>   DW_AT_type        : <0x299>
    <2aa>   DW_AT_external    : 1
    <2aa>   DW_AT_declaration : 1
 <1><2aa>: Abbrev Number: 15 (DW_TAG_variable)
    <2ab>   DW_AT_name        : (indirect string, offset: 0x253e): _IO_2_1_stdout_
    <2af>   DW_AT_decl_file   : 4
    <2b0>   DW_AT_decl_line   : 320
    <2b2>   DW_AT_type        : <0x299>
    <2b6>   DW_AT_external    : 1
    <2b6>   DW_AT_declaration : 1
 <1><2b6>: Abbrev Number: 15 (DW_TAG_variable)
    <2b7>   DW_AT_name        : (indirect string, offset: 0x1f14): _IO_2_1_stderr_
    <2bb>   DW_AT_decl_file   : 4
    <2bc>   DW_AT_decl_line   : 321
    <2be>   DW_AT_type        : <0x299>
    <2c2>   DW_AT_external    : 1
    <2c2>   DW_AT_declaration : 1
 <1><2c2>: Abbrev Number: 6 (DW_TAG_pointer_type)
    <2c3>   DW_AT_byte_size   : 4
    <2c4>   DW_AT_type        : <0xaa>
 <1><2c8>: Abbrev Number: 7 (DW_TAG_const_type)
    <2c9>   DW_AT_type        : <0x2c2>
 <1><2cd>: Abbrev Number: 16 (DW_TAG_variable)
    <2ce>   DW_AT_name        : (indirect string, offset: 0x3c6b): stdin
    <2d2>   DW_AT_decl_file   : 5
    <2d3>   DW_AT_decl_line   : 135
    <2d4>   DW_AT_type        : <0x26d>
    <2d8>   DW_AT_external    : 1
    <2d8>   DW_AT_declaration : 1
 <1><2d8>: Abbrev Number: 16 (DW_TAG_variable)
    <2d9>   DW_AT_name        : (indirect string, offset: 0xf78): stdout
    <2dd>   DW_AT_decl_file   : 5
    <2de>   DW_AT_decl_line   : 136
    <2df>   DW_AT_type        : <0x26d>
    <2e3>   DW_AT_external    : 1
    <2e3>   DW_AT_declaration : 1
 <1><2e3>: Abbrev Number: 16 (DW_TAG_variable)
    <2e4>   DW_AT_name        : (indirect string, offset: 0x2c8): stderr
    <2e8>   DW_AT_decl_file   : 5
    <2e9>   DW_AT_decl_line   : 137
    <2ea>   DW_AT_type        : <0x26d>
    <2ee>   DW_AT_external    : 1
    <2ee>   DW_AT_declaration : 1
 <1><2ee>: Abbrev Number: 16 (DW_TAG_variable)
    <2ef>   DW_AT_name        : (indirect string, offset: 0x15fa): sys_nerr
    <2f3>   DW_AT_decl_file   : 6
    <2f4>   DW_AT_decl_line   : 26
    <2f5>   DW_AT_type        : <0x5e>
    <2f9>   DW_AT_external    : 1
    <2f9>   DW_AT_declaration : 1
 <1><2f9>: Abbrev Number: 12 (DW_TAG_array_type)
    <2fa>   DW_AT_type        : <0x2c8>
    <2fe>   DW_AT_sibling     : <0x304>
 <2><302>: Abbrev Number: 17 (DW_TAG_subrange_type)
 <2><303>: Abbrev Number: 0
 <1><304>: Abbrev Number: 7 (DW_TAG_const_type)
    <305>   DW_AT_type        : <0x2f9>
 <1><309>: Abbrev Number: 16 (DW_TAG_variable)
    <30a>   DW_AT_name        : (indirect string, offset: 0x1500): sys_errlist
    <30e>   DW_AT_decl_file   : 6
    <30f>   DW_AT_decl_line   : 27
